var careerClass = [
    {
        width: 4,
        name: '互联网 IT 计算机',
        content: [
            {
                name: '硬件',
                content: [
                    {
                        name: '硬件工程师',
                        id: 4
                    },
                    {
                        name: '技术支持·维护工程师',
                        id: 5
                    },
                    {
                        name: '技术支持·维护经理',
                        id: 6
                    },
                    {
                        name: '硬件测试工程师',
                        id: 7
                    },
                    {
                        name: '信息技术专员',
                        id: 8
                    },
                    {
                        name: '系统管理员·网管',
                        id: 9
                    },

                ]
            },
            {
                name: '计算机软件',
                content: [
                    {
                        name: '软件工程师',
                        id: 10
                    },
                    {
                        name: '系统安全工程师',
                        id: 11
                    },
                    {
                        name: '系统集成工程师',
                        id: 12
                    },
                    {
                        name: 'ERP实施顾问',
                        id: 13
                    },
                    {
                        name: '文档工程师',
                        id: 14
                    },
                    {
                        name: '计算机辅助设计工程师',
                        id: 15
                    },
                    {
                        name: '系统分析员',
                        id: 16
                    },
                    {
                        name: '程序员',
                        id: 17
                    },
                    {
                        name: '软件测试工程师',
                        id: 18
                    },
                    {
                        name: '数字视频合成师',
                        id: 19
                    },
                    {
                        name: '数据库管理员',
                        id: 20
                    },
                    {
                        name: '计算机软件产品检验员',
                        id: 21
                    },
                    {
                        name: '数据库开发工程师',
                        id: 22
                    },
                    {
                        name: '嵌入式硬件开发工程师',
                        id: 23
                    },
                    {
                        name: '平面设计师',
                        id: 24
                    },
                    {
                        name: '计算机平面设计师',
                        id: 25
                    },
                    {
                        name: '网页设计师',
                        id: 26
                    },
                    {
                        name: '多媒体设计师',
                        id: 27
                    },
                    {
                        name: '动画设计师',
                        id: 28
                    },

                ]
            },
            {
                name: '网络电子商务',
                content: [
                    {
                        name: '网络工程师',
                        id: 29
                    },
                    {
                        name: '游戏程序设计师',
                        id: 30
                    },
                    {
                        name: '网络编辑',
                        id: 31
                    },
                    {
                        name: '互联网软件开发工程师',
                        id: 32
                    },
                    {
                        name: '游戏设计与开发员',
                        id: 33
                    },
                    {
                        name: '游戏美术设计师',
                        id: 34
                    },

                ]
            },

        ]
    },
    {
        width: 3,
        name: '电子 微电子',
        content: [
            {
                name: '电子技术',
                content: [
                    {
                        name: '电路工程师,技术员',
                        id: 35
                    },
                    {
                        name: '电子工程师',
                        id: 36
                    },
                    {
                        name: '电声,音响工程师,技术员',
                        id: 37
                    },
                    {
                        name: '电子元器件工程师',
                        id: 38
                    },
                    {
                        name: '电子电器维修工程师',
                        id: 39
                    },
                    {
                        name: '传感器应用工程师',
                        id: 40
                    },

                ]
            },
            {
                name: '半导体',
                content: [
                    {
                        name: '半导体技术工程师',
                        id: 41
                    },
                    {
                        name: '数码产品开发工程师',
                        id: 42
                    },

                ]
            },
            {
                name: '集成电路',
                content: [
                    {
                        name: '集成电路测试员',
                        id: 43
                    },
                    {
                        name: '集成电路IC设计,应用工程师',
                        id: 44
                    },

                ]
            },
            {
                name: '仪器仪表',
                content: [
                    {
                        name: '仪器仪表工程师',
                        id: 45
                    },
                    {
                        name: '激光头制造工',
                        id: 46
                    },
                    {
                        name: '光电工程师',
                        id: 47
                    },
                    {
                        name: '激光,光电子工程师',
                        id: 48
                    },
                    {
                        name: '光学工程师',
                        id: 49
                    },
                    {
                        name: '光学技术员',
                        id: 50
                    },

                ]
            },

        ]
    },
    {
        width: 2,
        name: '制造业',
        content: [
            {
                name: '汽车及零配件',
                content: [
                    {
                        name: '汽车设备设计师',
                        id: 51
                    },
                    {
                        name: '轮胎结构工程师',
                        id: 52
                    },
                    {
                        name: '汽车整车、车身、底盘设计师',
                        id: 53
                    },
                    {
                        name: '电动车开发设计工程师',
                        id: 54
                    },
                    {
                        name: '汽车内外饰零件工程师',
                        id: 55
                    },
                    {
                        name: '汽车灯具工程师',
                        id: 56
                    },
                    {
                        name: '汽车空调匹配工程师',
                        id: 57
                    },
                    {
                        name: '车辆维护工程师',
                        id: 58
                    },
                    {
                        name: '汽车电机工程师',
                        id: 59
                    },
                    {
                        name: '总装工艺工程师',
                        id: 60
                    },
                    {
                        name: '城轨车辆工艺工程师',
                        id: 61
                    },
                    {
                        name: '汽车·摩托车(机车)工程师',
                        id: 62
                    },

                ]
            },
            {
                name: '机械·设备·重工·机电',
                content: [
                    {
                        name: '设备工程师',
                        id: 63
                    },
                    {
                        name: '柴油机维修工程师',
                        id: 64
                    },
                    {
                        name: '内燃机工程师',
                        id: 65
                    },
                    {
                        name: '轮机工程师',
                        id: 66
                    },
                    {
                        name: '柴油机设计工程师',
                        id: 67
                    },
                    {
                        name: '数控工程师',
                        id: 68
                    },
                    {
                        name: '汽轮机装配工艺师',
                        id: 69
                    },
                    {
                        name: '工程·机械绘图员',
                        id: 70
                    },
                    {
                        name: '食品机械师',
                        id: 71
                    },
                    {
                        name: '机械工程师',
                        id: 72
                    },
                    {
                        name: '机械设计师',
                        id: 73
                    },
                    {
                        name: '机电工程师',
                        id: 74
                    },
                    {
                        name: '铸造·锻造工程师',
                        id: 75
                    },
                    {
                        name: 'CNC工程师',
                        id: 76
                    },
                    {
                        name: '机械维修工程师',
                        id: 77
                    },
                    {
                        name: '液压工程师',
                        id: 78
                    },
                    {
                        name: '冲压工程师',
                        id: 79
                    },
                    {
                        name: '无损探伤检测工程师',
                        id: 80
                    },
                    {
                        name: '锅炉工程师',
                        id: 81
                    },
                    {
                        name: '发动机工程师',
                        id: 82
                    },
                    {
                        name: '热处理工艺技术人员',
                        id: 83
                    },

                ]
            },
            {
                name: '原材料及加工',
                content: [
                    {
                        name: '模具工程师',
                        id: 84
                    },
                    {
                        name: '中频淬火工艺师',
                        id: 85
                    },
                    {
                        name: '橡胶工艺工程师',
                        id: 86
                    },
                    {
                        name: '橡胶配方工程师',
                        id: 87
                    },
                    {
                        name: '橡胶设计工程师',
                        id: 88
                    },
                    {
                        name: '塑胶工程师',
                        id: 89
                    },
                    {
                        name: '研金工程师',
                        id: 90
                    },
                    {
                        name: '加工工艺师',
                        id: 91
                    },
                    {
                        name: '产品工艺工程师',
                        id: 92
                    },
                    {
                        name: '材料工程师',
                        id: 93
                    },
                    {
                        name: '制造工程师',
                        id: 94
                    },
                    {
                        name: '夹具工程师',
                        id: 95
                    },
                    {
                        name: '焊接工程师',
                        id: 96
                    },
                    {
                        name: '注塑工程师',
                        id: 97
                    },
                    {
                        name: '冶金技术员',
                        id: 98
                    },
                    {
                        name: '铸造工程师',
                        id: 99
                    },
                    {
                        name: '碎样工',
                        id: 100
                    },
                    {
                        name: '有色冶金研发工程师',
                        id: 101
                    },
                    {
                        name: '铝合金生产工程师',
                        id: 102
                    },
                    {
                        name: '材料性能检验员',
                        id: 103
                    },
                    {
                        name: '磨片工',
                        id: 104
                    },
                    {
                        name: '掏洗工',
                        id: 105
                    },
                    {
                        name: '陶器设计师',
                        id: 106
                    },

                ]
            },

        ]
    },
    {
        width: 3,
        name: '石油 化工 能源',
        content: [
            {
                name: '石油',
                content: [
                    {
                        name: '润滑油工程师',
                        id: 107
                    },
                    {
                        name: '石油天然气技术人员',
                        id: 108
                    },

                ]
            },
            {
                name: '化工',
                content: [
                    {
                        name: '空气净化工程师',
                        id: 109
                    },
                    {
                        name: '涂装工艺师',
                        id: 110
                    },
                    {
                        name: '涂装设计师',
                        id: 111
                    },
                    {
                        name: '试验工程师(化工)',
                        id: 112
                    },
                    {
                        name: '化学工程师',
                        id: 113
                    },
                    {
                        name: '化工工程师',
                        id: 114
                    },
                    {
                        name: '化工工艺实验员',
                        id: 115
                    },
                    {
                        name: '纳米材料生产工程师',
                        id: 116
                    },
                    {
                        name: '水处理技术工程师(hf091)',
                        id: 117
                    },
                    {
                        name: '微生物污水处理工程师',
                        id: 118
                    },
                    {
                        name: '海水淡化工程师',
                        id: 119
                    },
                    {
                        name: '水质化验员',
                        id: 120
                    },
                    {
                        name: '环保工艺调试员',
                        id: 121
                    },
                    {
                        name: '废气处理工程师',
                        id: 122
                    },
                    {
                        name: '大气污染控制工艺设计师',
                        id: 123
                    },
                    {
                        name: '固体废物处理工程师',
                        id: 124
                    },
                    {
                        name: '环评工程师',
                        id: 125
                    },
                    {
                        name: '环保工程师',
                        id: 126
                    },
                    {
                        name: '环保技术员',
                        id: 127
                    },
                    {
                        name: '环境监测员',
                        id: 128
                    },
                    {
                        name: '环境工程技术员',
                        id: 129
                    },

                ]
            },
            {
                name: '地质矿产',
                content: [
                    {
                        name: '测量工程师',
                        id: 130
                    },
                    {
                        name: '测绘技术员',
                        id: 131
                    },
                    {
                        name: '大地测量技术员',
                        id: 132
                    },
                    {
                        name: '摄影测量技术员',
                        id: 133
                    },
                    {
                        name: '地图制图员',
                        id: 134
                    },
                    {
                        name: '地籍测绘员',
                        id: 135
                    },
                    {
                        name: '工程测量员',
                        id: 136
                    },
                    {
                        name: '测定和测试技术员',
                        id: 137
                    },
                    {
                        name: '地下管线探测员',
                        id: 138
                    },
                    {
                        name: '测绘产品检验工程师',
                        id: 139
                    },
                    {
                        name: '地质工程师',
                        id: 140
                    },
                    {
                        name: '矿业安全工程师',
                        id: 141
                    },
                    {
                        name: '地质监督员',
                        id: 142
                    },
                    {
                        name: '勘探工程师',
                        id: 143
                    },
                    {
                        name: '勘探分析师',
                        id: 144
                    },
                    {
                        name: '石油地质开发工程师',
                        id: 145
                    },
                    {
                        name: '油藏工程师',
                        id: 146
                    },
                    {
                        name: '井下作业(修井完井)工程师顾问',
                        id: 147
                    },
                    {
                        name: '钻前工程师',
                        id: 148
                    },
                    {
                        name: '钻井工程师',
                        id: 149
                    },
                    {
                        name: '测井工程师',
                        id: 150
                    },
                    {
                        name: '物探工程师',
                        id: 151
                    },
                    {
                        name: '完井监督员',
                        id: 152
                    },
                    {
                        name: '钻井监督员',
                        id: 153
                    },
                    {
                        name: '矿务工程师',
                        id: 154
                    },
                    {
                        name: '选矿工程师',
                        id: 155
                    },
                    {
                        name: '钻探工',
                        id: 156
                    },
                    {
                        name: '坑探工',
                        id: 157
                    },
                    {
                        name: '采样工',
                        id: 158
                    },
                    {
                        name: '水文地质工',
                        id: 159
                    },
                    {
                        name: '海洋地质取样工',
                        id: 160
                    },
                    {
                        name: '海洋土质实验工',
                        id: 161
                    },

                ]
            },

        ]
    },
    {
        width: 3,
        name: '房地产,建筑',
        content: [
            {
                name: '建筑',
                content: [
                    {
                        name: '建筑师(各类，如：船舶建筑师)',
                        id: 162
                    },
                    {
                        name: '监理工程师',
                        id: 163
                    },
                    {
                        name: '造价工程师',
                        id: 164
                    },
                    {
                        name: '土木·土建工程师',
                        id: 165
                    },
                    {
                        name: '钢结构设计技术人员',
                        id: 166
                    },
                    {
                        name: '路桥·隧道·港口·航道工程师',
                        id: 167
                    },
                    {
                        name: '筑路·养护·维修人员',
                        id: 168
                    },
                    {
                        name: '测量师·房屋测绘人员',
                        id: 169
                    },
                    {
                        name: '岩土工程师',
                        id: 170
                    },
                    {
                        name: '建筑工程管理员',
                        id: 171
                    },
                    {
                        name: '智能布线工程师',
                        id: 172
                    },
                    {
                        name: '现代建筑智能化设施人员',
                        id: 173
                    },
                    {
                        name: 'BAE辅助土建制图员',
                        id: 174
                    },
                    {
                        name: '建筑工程定额员',
                        id: 175
                    },

                ]
            },
            {
                name: '房地产',
                content: [
                    {
                        name: '房屋评估师',
                        id: 176
                    },
                    {
                        name: '房地产评估师,房地产估价师',
                        id: 177
                    },
                    {
                        name: '权证人员',
                        id: 178
                    },
                    {
                        name: '楼盘销售经理',
                        id: 179
                    },
                    {
                        name: '楼盘销售代表',
                        id: 180
                    },
                    {
                        name: '写字楼部项目拓展经理',
                        id: 181
                    },
                    {
                        name: '置业顾问',
                        id: 182
                    },
                    {
                        name: '前期专员',
                        id: 183
                    },
                    {
                        name: '拆迁主管',
                        id: 184
                    },
                    {
                        name: '房地产策划师',
                        id: 185
                    },

                ]
            },
            {
                name: '建材',
                content: [
                    {
                        name: '硅酸盐工程技术人员',
                        id: 186
                    },
                    {
                        name: '非金属矿及制品工程技术人员',
                        id: 187
                    },
                    {
                        name: '无机非金属新材料工程技术人员',
                        id: 188
                    },

                ]
            },
            {
                name: '家具室内设计',
                content: [
                    {
                        name: '光源与照明工程师',
                        id: 189
                    },
                    {
                        name: '室内装饰工程管理员',
                        id: 190
                    },
                    {
                        name: '室内装饰质量检验员',
                        id: 191
                    },
                    {
                        name: '家具设计师',
                        id: 192
                    },

                ]
            },
            {
                name: '装饰装潢',
                content: [
                    {
                        name: '汽车外形及装饰设计师',
                        id: 193
                    },
                    {
                        name: '陈列展览设计师',
                        id: 194
                    },
                    {
                        name: '商品展示和橱窗艺术设计师',
                        id: 195
                    },
                    {
                        name: '装潢设计师',
                        id: 196
                    },
                    {
                        name: '室内装饰设计师',
                        id: 197
                    },

                ]
            },

        ]
    },
    {
        width: 3,
        name: '贸易,进出口',
        content: [
            {
                name: '贸易',
                content: [
                    {
                        name: '商务经理·主管',
                        id: 198
                    },
                    {
                        name: '国内贸易经理·主管',
                        id: 199
                    },
                    {
                        name: '国内贸易专员·助理',
                        id: 200
                    },
                    {
                        name: '商务专员助理',
                        id: 201
                    },
                    {
                        name: '外贸经理·主管',
                        id: 202
                    },
                    {
                        name: '外贸专员·助理',
                        id: 203
                    },
                    {
                        name: '业务跟单员',
                        id: 204
                    },
                    {
                        name: '单证员',
                        id: 205
                    },
                    {
                        name: '租赁业务员',
                        id: 206
                    },
                    {
                        name: '典当业务员',
                        id: 207
                    },

                ]
            },
            {
                name: '进出口',
                content: [
                    {
                        name: '报关员',
                        id: 208
                    },

                ]
            },
            {
                name: '零售批发',
                content: [
                    {
                        name: '商店营业员',
                        id: 209
                    },
                    {
                        name: '收银员',
                        id: 210
                    },

                ]
            },

        ]
    },
    {
        width: 2,
        name: '消费品',
        content: [
            {
                name: '快速消费品',
                content: [
                    {
                        name: '食品检验员',
                        id: 211
                    },
                    {
                        name: '食品研发员',
                        id: 212
                    },

                ]
            },
            {
                name: '耐用消费品',
                content: [
                    {
                        name: '服装工艺师',
                        id: 213
                    },
                    {
                        name: '织造工程师',
                        id: 214
                    },
                    {
                        name: '打版师',
                        id: 215
                    },
                    {
                        name: '服装设计员',
                        id: 216
                    },
                    {
                        name: '染整工程师',
                        id: 217
                    },
                    {
                        name: '服装裁剪工',
                        id: 218
                    },
                    {
                        name: '高级制板师',
                        id: 219
                    },
                    {
                        name: 'CAD制版师',
                        id: 220
                    },
                    {
                        name: '服装样板师',
                        id: 221
                    },
                    {
                        name: '纺纱工程师',
                        id: 222
                    },
                    {
                        name: '纸样师',
                        id: 223
                    },
                    {
                        name: '影视服装员',
                        id: 224
                    },
                    {
                        name: '染色师',
                        id: 225
                    },
                    {
                        name: '服装设计师',
                        id: 226
                    },
                    {
                        name: '花型图案设计师',
                        id: 227
                    },
                    {
                        name: '纺织品设计师',
                        id: 228
                    },
                    {
                        name: '鞋业设计师',
                        id: 229
                    },
                    {
                        name: '家用纺织品设计师',
                        id: 230
                    },

                ]
            },

        ]
    },
    {
        width: 2,
        name: '交通,物流',
        content: [
            {
                name: '交通',
                content: [
                    {
                        name: '航空产品装配与调试员',
                        id: 231
                    },
                    {
                        name: '铁路机务工程师',
                        id: 232
                    },
                    {
                        name: '飞机机械员',
                        id: 233
                    },
                    {
                        name: '飞行领航员',
                        id: 234
                    },
                    {
                        name: '飞行器制造工程师',
                        id: 235
                    },
                    {
                        name: '航空维修技术人员',
                        id: 236
                    },
                    {
                        name: '铁路运输工程师',
                        id: 237
                    },
                    {
                        name: '铁路车辆工程师',
                        id: 238
                    },
                    {
                        name: '铁路电务工程师',
                        id: 239
                    },
                    {
                        name: '空间工程师',
                        id: 240
                    },
                    {
                        name: '飞机驾驶员',
                        id: 241
                    },
                    {
                        name: '飞行通信员',
                        id: 242
                    },
                    {
                        name: '飞行器设计师',
                        id: 243
                    },
                    {
                        name: '航空地面设备设计师',
                        id: 244
                    },
                    {
                        name: '飞行器动力工程师',
                        id: 245
                    },
                    {
                        name: '船舶工程师',
                        id: 246
                    },
                    {
                        name: '船舶设计师',
                        id: 247
                    },
                    {
                        name: '船舶驾驶员·船长',
                        id: 248
                    },
                    {
                        name: '大副、二副、三副',
                        id: 249
                    },
                    {
                        name: '轮机长',
                        id: 250
                    },
                    {
                        name: '大管轮、二管轮、三管轮',
                        id: 251
                    },
                    {
                        name: '水手',
                        id: 252
                    },
                    {
                        name: '船舶引航员',
                        id: 253
                    },
                    {
                        name: '船舶检验工程技术员',
                        id: 254
                    },
                    {
                        name: '船舶运用工程技术员',
                        id: 255
                    },
                    {
                        name: '室内环境治理员',
                        id: 256
                    },
                    {
                        name: '汽车客运服务员',
                        id: 257
                    },
                    {
                        name: '旅客列车乘务员',
                        id: 258
                    },
                    {
                        name: '船舶业务员',
                        id: 259
                    },
                    {
                        name: '港口客运员',
                        id: 260
                    },
                    {
                        name: '汽车运输调度员',
                        id: 261
                    },
                    {
                        name: '公路收费及监控员',
                        id: 262
                    },
                    {
                        name: '航空乘务员',
                        id: 263
                    },
                    {
                        name: '航空运输地面服务人员',
                        id: 264
                    },
                    {
                        name: '航空审查员',
                        id: 265
                    },

                ]
            },
            {
                name: '运输',
                content: [
                    {
                        name: '汽车货运站务员',
                        id: 266
                    },
                    {
                        name: '货物审查员',
                        id: 267
                    },
                    {
                        name: '邮件处理员',
                        id: 268
                    },
                    {
                        name: '行包运输服务员',
                        id: 269
                    },
                    {
                        name: '车站货运员',
                        id: 270
                    },
                    {
                        name: '海洋货物审查员',
                        id: 271
                    },
                    {
                        name: '邮政营业员',
                        id: 272
                    },
                    {
                        name: '投递员',
                        id: 273
                    },
                    {
                        name: '邮政储汇员',
                        id: 274
                    },
                    {
                        name: '邮政业务档案员',
                        id: 275
                    },
                    {
                        name: '邮政机务员',
                        id: 276
                    },
                    {
                        name: '集邮业务员',
                        id: 277
                    },

                ]
            },
            {
                name: '物流仓储',
                content: [
                    {
                        name: '仓库经理·主管',
                        id: 278
                    },
                    {
                        name: '物流经理·主管',
                        id: 279
                    },
                    {
                        name: '物流管理师',
                        id: 280
                    },
                    {
                        name: '物流专员·助理',
                        id: 281
                    },
                    {
                        name: '采购经理·主管',
                        id: 282
                    },
                    {
                        name: '采购工程师',
                        id: 283
                    },
                    {
                        name: '采购员·助理',
                        id: 284
                    },
                    {
                        name: '供应链经理·主管',
                        id: 285
                    },
                    {
                        name: '供应链专员·助理',
                        id: 286
                    },
                    {
                        name: '运输经理·主管',
                        id: 287
                    },
                    {
                        name: '单证部经理',
                        id: 288
                    },
                    {
                        name: '防损主管',
                        id: 289
                    },
                    {
                        name: '货运代理人员',
                        id: 290
                    },
                    {
                        name: '海·陆·空运业务经理',
                        id: 291
                    },
                    {
                        name: '船舶租赁人员',
                        id: 292
                    },
                    {
                        name: '调度员',
                        id: 293
                    },
                    {
                        name: '拼箱业务主管',
                        id: 294
                    },
                    {
                        name: '航线主管',
                        id: 295
                    },
                    {
                        name: '商品储运员',
                        id: 296
                    },
                    {
                        name: '仓库保管员',
                        id: 297
                    },
                    {
                        name: '理货员',
                        id: 298
                    },
                    {
                        name: '商品养护员',
                        id: 299
                    },
                    {
                        name: '保鲜员',
                        id: 300
                    },
                    {
                        name: '冷藏工',
                        id: 301
                    },
                    {
                        name: '立库管理技术人员',
                        id: 302
                    },
                    {
                        name: '商品护运员',
                        id: 303
                    },

                ]
            },

        ]
    },
    {
        width: 2,
        name: '教育,科研',
        content: [
            {
                name: '教育',
                content: [
                    {
                        name: '课程设计开发专员',
                        id: 304
                    },
                    {
                        name: '教学主管(主任)',
                        id: 305
                    },
                    {
                        name: '招生人员',
                        id: 306
                    },
                    {
                        name: '高校辅导员',
                        id: 307
                    },
                    {
                        name: '心理指导老师',
                        id: 308
                    },
                    {
                        name: '中等学校校长',
                        id: 309
                    },
                    {
                        name: '教学助理',
                        id: 310
                    },
                    {
                        name: '总务主任',
                        id: 311
                    },
                    {
                        name: '教务人员',
                        id: 312
                    },
                    {
                        name: '招生主管',
                        id: 313
                    },
                    {
                        name: '就业指导老师',
                        id: 314
                    },
                    //{
                    //    name: '大学教师',
                    //    id: 315
                    //},
                    {
                        name: '中等职业教育教师(各科)',
                        id: 316
                    },
                    //{
                    //    name: '中学教师(各科)',
                    //    id: 317
                    //},
                    {
                        name: '小学教师(各科)',
                        id: 318
                    },
                    //Such a long one ......
                    //{
                    //    name: '幼儿教师(各科)',
                    //    id: 319
                    //},
                    {
                        name: '高等学校校长',
                        id: 320
                    },
                    {
                        name: '中等职业教育学校校长',
                        id: 321
                    },
                    {
                        name: '小学校长',
                        id: 322
                    },
                    {
                        name: '幼儿园院长',
                        id: 323
                    },
                    //Such a long one ......
                    //{
                    //    name: '校长',
                    //    id: 324
                    //},
                    {
                        name: '教学研究员(教研员)',
                        id: 325
                    },
                    {
                        name: '教务主任',
                        id: 326
                    },
                    {
                        name: '特殊教育教师(幼儿)(各科)',
                        id: 327
                    },
                    {
                        name: '特殊教育教师(小学)(各科)',
                        id: 328
                    },
                    {
                        name: '特殊教育教师(初中)(各科)',
                        id: 329
                    },
                    {
                        name: '特殊教育教师(高中)(各科)',
                        id: 330
                    },
                    {
                        name: '助教(各科)',
                        id: 331
                    },

                ]
            },
            {
                name: '培训',
                content: [
                    {
                        name: '培训师(各类)',
                        id: 332
                    },
                    {
                        name: '培训经理主管',
                        id: 333
                    },
                    {
                        name: '培训专员助理',
                        id: 334
                    },
                    {
                        name: '拓展训练师',
                        id: 335
                    },

                ]
            },
            {
                name: '科研',
                content: [
                    {
                        name: '(各类)专家学者',
                        id: 336
                    },
                    {
                        name: '(各类)科研人员',
                        id: 337
                    },
                    {
                        name: '(各类)科技服务人员',
                        id: 338
                    },

                ]
            },

        ]
    },
    {
        width: 3,
        name: '艺术,休闲,运动',
        content: [
            {
                name: '艺术',
                content: [
                    {
                        name: '乐器演奏员',
                        id: 339
                    },
                    {
                        name: '画家',
                        id: 340
                    },
                    {
                        name: '现代工艺设计人员',
                        id: 341
                    },
                    {
                        name: '人物造型设计师',
                        id: 342
                    },
                    {
                        name: '手工艺家',
                        id: 343
                    },
                    {
                        name: '艺术·设计总监',
                        id: 344
                    },
                    {
                        name: '陶艺家',
                        id: 345
                    },
                    {
                        name: '工艺品设计师',
                        id: 346
                    },
                    {
                        name: '篆刻家',
                        id: 347
                    },
                    {
                        name: '雕塑家',
                        id: 348
                    },
                    {
                        name: '书法家',
                        id: 349
                    },
                    {
                        name: '词作家',
                        id: 350
                    },
                    {
                        name: '皮影戏木偶戏作家',
                        id: 351
                    },
                    {
                        name: '人体彩绘师',
                        id: 352
                    },
                    {
                        name: '舞蹈编导',
                        id: 353
                    },
                    {
                        name: '戏剧人员',
                        id: 354
                    },
                    {
                        name: '电影电视演员',
                        id: 355
                    },
                    {
                        name: '戏剧演员',
                        id: 356
                    },
                    {
                        name: '舞蹈演员',
                        id: 357
                    },
                    {
                        name: '曲艺演员',
                        id: 358
                    },
                    {
                        name: '杂技魔术演员',
                        id: 359
                    },
                    {
                        name: '歌唱演员',
                        id: 360
                    },
                    {
                        name: '皮影戏演员',
                        id: 361
                    },
                    {
                        name: '音乐指挥',
                        id: 362
                    },
                    {
                        name: '民族乐器演奏员',
                        id: 363
                    },
                    {
                        name: '外国乐器演奏员',
                        id: 364
                    },
                    {
                        name: '调律师',
                        id: 365
                    },
                    {
                        name: '化妆师·造型师',
                        id: 366
                    },
                    {
                        name: '曲艺作家',
                        id: 367
                    },
                    {
                        name: '剧作家',
                        id: 368
                    },
                    {
                        name: '作曲家',
                        id: 369
                    },
                    {
                        name: '计算机乐谱制作师',
                        id: 370
                    },

                ]
            },
            {
                name: '休闲',
                content: [
                    {
                        name: '玩具设计师',
                        id: 371
                    },
                    {
                        name: '模特',
                        id: 372
                    },
                    {
                        name: '手模特',
                        id: 373
                    },
                    {
                        name: '古玩鉴定师',
                        id: 374
                    },
                    {
                        name: '美容师',
                        id: 375
                    },
                    {
                        name: '美发师',
                        id: 376
                    },
                    {
                        name: '美甲师',
                        id: 377
                    },
                    {
                        name: '纹绣师',
                        id: 378
                    },

                ]
            },
            {
                name: '运动',
                content: [
                    {
                        name: '教练员',
                        id: 379
                    },
                    {
                        name: '裁判员',
                        id: 380
                    },
                    {
                        name: '运动员',
                        id: 381
                    },

                ]
            },

        ]
    },
    {
        width: 4,
        name: '农,林,牧,渔,水利',
        content: [
            {
                name: '农业',
                content: [
                    {
                        name: '高级农艺师',
                        id: 382
                    },
                    {
                        name: '农技师',
                        id: 383
                    },
                    {
                        name: '农业技术指导员',
                        id: 384
                    },
                    {
                        name: '作物遗传育种栽培员',
                        id: 385
                    },
                    {
                        name: '农业实验工',
                        id: 386
                    },
                    {
                        name: '农情测报员',
                        id: 387
                    },
                    {
                        name: '农业生产分析员',
                        id: 388
                    },

                ]
            },
            {
                name: '园林业',
                content: [
                    {
                        name: '园艺师',
                        id: 389
                    },
                    {
                        name: '农业果林工程师',
                        id: 390
                    },
                    {
                        name: '中药材种植员',
                        id: 391
                    },
                    {
                        name: '果树栽培技术员',
                        id: 392
                    },
                    {
                        name: '园林工程师',
                        id: 393
                    },
                    {
                        name: '园艺工程师',
                        id: 394
                    },
                    {
                        name: '园艺养护员',
                        id: 395
                    },
                    {
                        name: '草地监护员',
                        id: 396
                    },
                    {
                        name: '绿化工程师',
                        id: 397
                    },
                    {
                        name: '自然保护区巡护监测员',
                        id: 398
                    },
                    {
                        name: '园林景观设计师',
                        id: 399
                    },
                    {
                        name: '花艺环境设计师',
                        id: 400
                    },

                ]
            },
            {
                name: '牧业',
                content: [
                    {
                        name: '动物营养专家',
                        id: 401
                    },
                    {
                        name: '家畜饲养员',
                        id: 402
                    },
                    {
                        name: '实验动物饲养员',
                        id: 403
                    },
                    {
                        name: '兽医',
                        id: 404
                    },
                    {
                        name: '动物疫病防治员',
                        id: 405
                    },
                    {
                        name: '动物检疫检验员',
                        id: 406
                    },
                    {
                        name: '畜牧师',
                        id: 407
                    },
                    {
                        name: '标本员',
                        id: 408
                    },
                    {
                        name: '野生植物保护员',
                        id: 409
                    },
                    {
                        name: '饲料化验员',
                        id: 410
                    },
                    {
                        name: '兽药或饲料研发',
                        id: 411
                    },

                ]
            },
            {
                name: '渔业',
                content: [
                    {
                        name: '水产品质量检验员',
                        id: 412
                    },
                    {
                        name: '水产养殖技术员',
                        id: 413
                    },

                ]
            },
            {
                name: '水利',
                content: [
                    {
                        name: '渠道维护工',
                        id: 414
                    },
                    {
                        name: '水利·水电工程师',
                        id: 415
                    },
                    {
                        name: '灌排工程员',
                        id: 416
                    },
                    {
                        name: '灌区供水工',
                        id: 417
                    },
                    {
                        name: '农村节能员',
                        id: 418
                    },
                    {
                        name: '农田灌排工程建设管理维护员',
                        id: 419
                    },
                    {
                        name: '河道、水库管养员',
                        id: 420
                    },
                    {
                        name: '水土保持防治工',
                        id: 421
                    },
                    {
                        name: '水土保持测试工',
                        id: 422
                    },
                    {
                        name: '水土保持勘测工',
                        id: 423
                    },
                    {
                        name: '灌溉实验工',
                        id: 424
                    },
                    {
                        name: '水域环境养护保洁员',
                        id: 425
                    },

                ]
            },

        ]
    },
    {
        width: 1,
        name: '其他',
        content: [
            {
                name: '其他',
                content: [
                    {
                        name: '司机',
                        id: 426
                    },
                    {
                        name: '工业造型设计师',
                        id: 427
                    },
                    {
                        name: '文物鉴定、保护专业人员',
                        id: 428
                    },
                    {
                        name: '宝玉石检验员',
                        id: 429
                    },
                    {
                        name: '珠宝首饰评估师',
                        id: 430
                    },
                    {
                        name: '电子竞技选手',
                        id: 431
                    },
                    {
                        name: '城镇规划设计师',
                        id: 432
                    },
                    {
                        name: '珠宝设计师',
                        id: 433
                    },
                    {
                        name: '速录师',
                        id: 434
                    },

                ]
            },

        ]
    },
    {
        width: 1,
        name: '通讯',
        content: [
            {
                name: '通讯',
                content: [
                    {
                        name: '通信技术工程师',
                        id: 435
                    },
                    {
                        name: '电信交换工程师',
                        id: 436
                    },
                    {
                        name: '无线电工程师',
                        id: 437
                    },
                    {
                        name: '电信业务营业员',
                        id: 438
                    },
                    {
                        name: '话务员',
                        id: 439
                    },
                    {
                        name: '报务员',
                        id: 440
                    },
                    {
                        name: '传输机务员',
                        id: 441
                    },
                    {
                        name: '线务员',
                        id: 442
                    },
                    {
                        name: '电话电报机务员',
                        id: 443
                    },
                    {
                        name: '用户通信终端维修员',
                        id: 444
                    },
                    {
                        name: '通信电力机务员',
                        id: 445
                    },
                    {
                        name: '市话测量员',
                        id: 446
                    },

                ]
            },

        ]
    },
    {
        width: 2,
        name: '电气,电力',
        content: [
            {
                name: '电气,电力',
                content: [
                    {
                        name: '电气工程师',
                        id: 447
                    },
                    {
                        name: '电器工程师',
                        id: 448
                    },
                    {
                        name: '变压器与磁电工程师',
                        id: 449
                    },
                    {
                        name: '核力·火力工程师',
                        id: 450
                    },
                    {
                        name: '电力工程师',
                        id: 451
                    },
                    {
                        name: '电气维修技术员',
                        id: 452
                    },
                    {
                        name: '调试工程师',
                        id: 453
                    },

                ]
            },

        ]
    },
    {
        width: 3,
        name: '石油,化工,能源',
        content: [
            {
                name: '化工',
                content: [
                    {
                        name: '环安工程师',
                        id: 454
                    },

                ]
            },
            {
                name: '其他能源',
                content: [
                    {
                        name: '制冷工程师',
                        id: 455
                    },
                    {
                        name: '空调·热能工程师',
                        id: 456
                    },
                    {
                        name: '太阳能工程师',
                        id: 457
                    },
                    {
                        name: '小风电利用工',
                        id: 458
                    },
                    {
                        name: '风力发电工程师',
                        id: 459
                    },
                    {
                        name: '暖通工程技术人员',
                        id: 460
                    },
                    {
                        name: '给排水工程师',
                        id: 461
                    },
                    {
                        name: '微水电利用工',
                        id: 462
                    },
                    {
                        name: '核工程师',
                        id: 463
                    },

                ]
            },

        ]
    },
    {
        width: 2,
        name: '金融,银行',
        content: [
            {
                name: '证券·基金',
                content: [
                    {
                        name: '证券发行员',
                        id: 464
                    },
                    {
                        name: '证券交易员',
                        id: 465
                    },
                    {
                        name: '证券投资顾问',
                        id: 466
                    },
                    {
                        name: '证券交易部门经理',
                        id: 467
                    },
                    {
                        name: '证券分析师',
                        id: 468
                    },
                    {
                        name: '基金经理',
                        id: 469
                    },

                ]
            },
            {
                name: '银行',
                content: [
                    {
                        name: '银行业守规经理',
                        id: 470
                    },
                    {
                        name: '银行货币发行员',
                        id: 471
                    },
                    {
                        name: '银行国库业务人员',
                        id: 472
                    },
                    {
                        name: '银行清算员',
                        id: 473
                    },
                    {
                        name: '银行存款部经理',
                        id: 474
                    },
                    {
                        name: '银行信贷部经理',
                        id: 475
                    },
                    {
                        name: '资金调度员',
                        id: 476
                    },
                    {
                        name: '银行外汇管理员',
                        id: 477
                    },
                    {
                        name: '银行信贷员',
                        id: 478
                    },
                    {
                        name: '银行国外经理·业务人员',
                        id: 479
                    },
                    {
                        name: '银行信托经理·业务人员',
                        id: 480
                    },
                    {
                        name: '银行信用卡经理·业务人员',
                        id: 481
                    },
                    {
                        name: '银行票据业务人员',
                        id: 482
                    },
                    {
                        name: '利率管理人员',
                        id: 483
                    },
                    {
                        name: '外汇交易员',
                        id: 484
                    },
                    {
                        name: '外汇信贷管理员',
                        id: 485
                    },
                    {
                        name: '外汇贷款审查员',
                        id: 486
                    },
                    {
                        name: '理财规划师',
                        id: 487
                    },
                    {
                        name: '家庭理财顾问',
                        id: 488
                    },
                    {
                        name: '个人综合理财顾问',
                        id: 489
                    },
                    {
                        name: '银行柜员',
                        id: 490
                    },

                ]
            },
            {
                name: '保险',
                content: [
                    {
                        name: '信用管理师',
                        id: 491
                    },
                    {
                        name: '保险代理人',
                        id: 492
                    },
                    {
                        name: '保险经纪人',
                        id: 493
                    },
                    {
                        name: '寿险顾问·寿险规划师',
                        id: 494
                    },
                    {
                        name: '保险公估人',
                        id: 495
                    },
                    {
                        name: '保险精算师',
                        id: 496
                    },
                    {
                        name: '保险核保师',
                        id: 497
                    },
                    {
                        name: '保险保全师',
                        id: 498
                    },
                    {
                        name: '保险理赔员',
                        id: 499
                    },

                ]
            },
            {
                name: '投资',
                content: [
                    {
                        name: '投资经理',
                        id: 500
                    },
                    {
                        name: '投资分析师',
                        id: 501
                    },
                    {
                        name: '资产评估师',
                        id: 502
                    },
                    {
                        name: '资本运营经理',
                        id: 503
                    },
                    {
                        name: '融资项目经理',
                        id: 504
                    },
                    {
                        name: '融资专员,经理',
                        id: 505
                    },
                    {
                        name: '金融分析师',
                        id: 506
                    },
                    {
                        name: '外汇经纪人',
                        id: 507
                    },
                    {
                        name: '期货经纪人',
                        id: 508
                    },
                    {
                        name: '旧货估价员',
                        id: 509
                    },
                    {
                        name: '鉴定估价师',
                        id: 510
                    },

                ]
            },

        ]
    },
    {
        width: 4,
        name: '文化,媒体,出版,印刷',
        content: [
            {
                name: '影视',
                content: [
                    {
                        name: '照明设备操作工',
                        id: 511
                    },
                    {
                        name: '影视设备机械工',
                        id: 512
                    },
                    {
                        name: '广播电视天线工',
                        id: 513
                    },
                    {
                        name: '有线广播电视机线员',
                        id: 514
                    },
                    {
                        name: '拷贝字幕员',
                        id: 515
                    },
                    {
                        name: '录音师',
                        id: 516
                    },
                    {
                        name: '音效师',
                        id: 517
                    },
                    {
                        name: '配音师',
                        id: 518
                    },
                    {
                        name: '冲影师',
                        id: 519
                    },
                    {
                        name: '照明师',
                        id: 520
                    },
                    {
                        name: '演播室导演',
                        id: 521
                    },
                    {
                        name: '影视舞台烟火特效员',
                        id: 522
                    },
                    {
                        name: '影视木偶制作员',
                        id: 523
                    },
                    {
                        name: '电影洗印员',
                        id: 524
                    },
                    {
                        name: '剪辑师',
                        id: 525
                    },
                    {
                        name: '广播电视编播工程技术人员',
                        id: 526
                    },
                    {
                        name: '广播电视传输覆盖工程技术人员',
                        id: 527
                    },
                    {
                        name: '道具师',
                        id: 528
                    },
                    {
                        name: '舞台设计师',
                        id: 529
                    },
                    {
                        name: '电影电视导演·编导',
                        id: 530
                    },
                    {
                        name: '栏目策划',
                        id: 531
                    },
                    {
                        name: '戏剧制作人',
                        id: 532
                    },
                    {
                        name: '演艺或体育经纪人',
                        id: 533
                    },
                    {
                        name: '电影电视场记',
                        id: 534
                    },
                    {
                        name: '舞台监督',
                        id: 535
                    },
                    {
                        name: '摄影师',
                        id: 536
                    },
                    {
                        name: '摄像师',
                        id: 537
                    },
                    {
                        name: '电影放映员',
                        id: 538
                    },

                ]
            },
            {
                name: '文化传播',
                content: [
                    {
                        name: '记者',
                        id: 539
                    },
                    {
                        name: '总编·副总编',
                        id: 540
                    },
                    {
                        name: '诗人',
                        id: 541
                    },
                    {
                        name: '发行总监·经理·主管',
                        id: 542
                    },
                    {
                        name: '文字编辑',
                        id: 543
                    },
                    {
                        name: '作家·撰稿人',
                        id: 544
                    },
                    {
                        name: '社长·副社长',
                        id: 545
                    },
                    {
                        name: '美术编辑',
                        id: 546
                    },
                    {
                        name: '电视评论员',
                        id: 547
                    },
                    {
                        name: '戏剧评论员',
                        id: 548
                    },
                    {
                        name: '文学作家',
                        id: 549
                    },
                    {
                        name: '广播评论员',
                        id: 550
                    },
                    {
                        name: '电影评论员',
                        id: 551
                    },
                    {
                        name: '音乐评论员',
                        id: 552
                    },
                    {
                        name: '电视主持人',
                        id: 553
                    },
                    {
                        name: '电台主持人',
                        id: 554
                    },
                    {
                        name: '艺术评论员',
                        id: 555
                    },
                    {
                        name: '同声传译',
                        id: 556
                    },
                    {
                        name: '口译人员(各语种)',
                        id: 557
                    },
                    {
                        name: '笔译人员(各语种)',
                        id: 558
                    },

                ]
            },
            {
                name: '出版印刷',
                content: [
                    {
                        name: '拷贝检片员',
                        id: 559
                    },
                    {
                        name: '校对人员',
                        id: 560
                    },
                    {
                        name: '排版设计人员',
                        id: 561
                    },
                    {
                        name: '印刷操作员',
                        id: 562
                    },
                    {
                        name: '印后制作员',
                        id: 563
                    },
                    {
                        name: '唱片员',
                        id: 564
                    },
                    {
                        name: '唱片检听工',
                        id: 565
                    },
                    {
                        name: '音像带复制工',
                        id: 566
                    },
                    {
                        name: '光盘复制工',
                        id: 567
                    },
                    {
                        name: '印前制作员',
                        id: 568
                    },
                    {
                        name: '出版物发行员',
                        id: 569
                    },
                    {
                        name: '电影电视片发行人',
                        id: 570
                    },
                    {
                        name: '包装设计师',
                        id: 571
                    },
                    {
                        name: '电影电视片制片人',
                        id: 572
                    },
                    {
                        name: '报刊发行员',
                        id: 573
                    },

                ]
            },

        ]
    },
    {
        width: 3,
        name: '服务,中介,物业',
        content: [
            {
                name: '服务',
                content: [
                    {
                        name: '洗衣师',
                        id: 574
                    },
                    {
                        name: '钟表维修工',
                        id: 575
                    },
                    {
                        name: '气象观测员',
                        id: 576
                    },
                    {
                        name: '自行车维修工',
                        id: 577
                    },
                    {
                        name: '生活燃料供应工',
                        id: 578
                    },
                    {
                        name: '印章刻字技师',
                        id: 579
                    },
                    {
                        name: '乐器维修工',
                        id: 580
                    },
                    {
                        name: '锁匠',
                        id: 581
                    },
                    {
                        name: '供水生产工',
                        id: 582
                    },
                    {
                        name: '验光师',
                        id: 583
                    },
                    {
                        name: '眼镜定配员',
                        id: 584
                    },
                    {
                        name: '照相器材维修工',
                        id: 585
                    },
                    {
                        name: '家用电子产品维修工',
                        id: 586
                    },
                    {
                        name: '家用电器产品维修工',
                        id: 587
                    },
                    {
                        name: '消防与安保工程师',
                        id: 588
                    },
                    {
                        name: '海上救助打捞工程技术人员',
                        id: 589
                    },
                    {
                        name: '礼仪主持人',
                        id: 590
                    },
                    {
                        name: '消防员',
                        id: 591
                    },
                    {
                        name: '家政服务人员',
                        id: 592
                    },
                    {
                        name: '保安·警卫',
                        id: 593
                    },
                    {
                        name: '私人保安',
                        id: 594
                    },
                    {
                        name: '金融守押员',
                        id: 595
                    },
                    {
                        name: '紧急救助员',
                        id: 596
                    },
                    {
                        name: '防火员',
                        id: 597
                    },
                    {
                        name: '售票员·票务',
                        id: 598
                    },
                    {
                        name: '天气预报员',
                        id: 599
                    },

                ]
            },
            {
                name: '中介',
                content: [
                    {
                        name: '拍卖师',
                        id: 600
                    },
                    {
                        name: '房产经纪人',
                        id: 601
                    },
                    {
                        name: '签证专员',
                        id: 602
                    },
                    {
                        name: '专利代理人',
                        id: 603
                    },
                    {
                        name: '二手车交易员',
                        id: 604
                    },
                    {
                        name: '技术经纪人',
                        id: 605
                    },
                    {
                        name: '二手车评估师',
                        id: 606
                    },

                ]
            },
            {
                name: '物业',
                content: [
                    {
                        name: '物业管理师',
                        id: 607
                    },
                    {
                        name: '楼面经理',
                        id: 608
                    },
                    {
                        name: '物业顾问',
                        id: 609
                    },

                ]
            },

        ]
    },
    {
        width: 3,
        name: '旅游,酒店,餐饮',
        content: [
            {
                name: '旅游',
                content: [
                    {
                        name: '旅游计调员',
                        id: 610
                    },
                    {
                        name: '国内导游',
                        id: 611
                    },
                    {
                        name: '国际导游',
                        id: 612
                    },
                    {
                        name: '旅游外联员',
                        id: 613
                    },
                    {
                        name: '公共游览场所服务员',
                        id: 614
                    },
                    {
                        name: '展览讲解员',
                        id: 615
                    },

                ]
            },
            {
                name: '酒店',
                content: [
                    {
                        name: '迎宾员',
                        id: 616
                    },
                    {
                        name: '宴会会务部经理',
                        id: 617
                    },
                    {
                        name: '安管部经理',
                        id: 618
                    },
                    {
                        name: '食品检验主管',
                        id: 619
                    },
                    {
                        name: '宾馆·酒店·饭店经理',
                        id: 620
                    },
                    {
                        name: '大堂经理·副理',
                        id: 621
                    },
                    {
                        name: '客房部经理',
                        id: 622
                    },
                    {
                        name: '洗涤部经理',
                        id: 623
                    },
                    {
                        name: '礼宾部经理',
                        id: 624
                    },
                    {
                        name: '大堂经理',
                        id: 625
                    },

                ]
            },
            {
                name: '餐饮',
                content: [
                    {
                        name: '中式烹调师',
                        id: 626
                    },
                    {
                        name: '中式面点师',
                        id: 627
                    },
                    {
                        name: '西式烹调师',
                        id: 628
                    },
                    {
                        name: '西式面点师',
                        id: 629
                    },
                    {
                        name: '调酒师',
                        id: 630
                    },
                    {
                        name: '茶艺师',
                        id: 631
                    },
                    {
                        name: '营养配餐员',
                        id: 632
                    },
                    {
                        name: '评茶员',
                        id: 633
                    },
                    {
                        name: '茶叶审评师',
                        id: 634
                    },
                    {
                        name: '饭店前庭服务员',
                        id: 635
                    },
                    {
                        name: '餐饮部经理·副经理',
                        id: 636
                    },
                    {
                        name: '餐饮行政经理',
                        id: 637
                    },
                    {
                        name: '餐饮项目策划经理',
                        id: 638
                    },
                    {
                        name: '餐厅领班',
                        id: 639
                    },
                    {
                        name: '酒吧服务员',
                        id: 640
                    },
                    {
                        name: '餐厅服务员',
                        id: 641
                    },
                    {
                        name: '餐具清洗保管员',
                        id: 642
                    },
                    {
                        name: '饭店客房服务员',
                        id: 643
                    },

                ]
            },

        ]
    },
    {
        width: 3,
        name: '生物,医疗,保健',
        content: [
            {
                name: '生物',
                content: [
                    {
                        name: '生物工程师',
                        id: 644
                    },
                    {
                        name: '生物医学工程师',
                        id: 645
                    },
                    {
                        name: '生物医药工程设计师',
                        id: 646
                    },
                    {
                        name: '细胞培养技术员',
                        id: 647
                    },
                    {
                        name: '发酵工程师',
                        id: 648
                    },

                ]
            },
            {
                name: '医疗',
                content: [
                    {
                        name: '输(采供)血技师',
                        id: 649
                    },
                    {
                        name: '麻醉技师',
                        id: 650
                    },
                    {
                        name: '心电医师',
                        id: 651
                    },
                    {
                        name: '医学影像技师',
                        id: 652
                    },
                    {
                        name: '病理技师',
                        id: 653
                    },
                    {
                        name: '临床检验技师',
                        id: 654
                    },
                    {
                        name: '(西医)儿科医师',
                        id: 655
                    },
                    {
                        name: '妇产科医生',
                        id: 656
                    },
                    {
                        name: '骨科医生',
                        id: 657
                    },
                    {
                        name: '眼科医师',
                        id: 658
                    },
                    {
                        name: '耳鼻喉科医师',
                        id: 659
                    },
                    {
                        name: '口腔医生',
                        id: 660
                    },
                    {
                        name: '消化科医生',
                        id: 661
                    },
                    {
                        name: '心血管科医生',
                        id: 662
                    },
                    {
                        name: '肝胆科医生',
                        id: 663
                    },
                    {
                        name: '皮肤科医师',
                        id: 664
                    },
                    {
                        name: '性病科医师',
                        id: 665
                    },
                    {
                        name: '脑科医生',
                        id: 666
                    },
                    {
                        name: '精神科医师',
                        id: 667
                    },
                    {
                        name: '内科医生',
                        id: 668
                    },
                    {
                        name: '呼吸科医生',
                        id: 669
                    },
                    {
                        name: '心理科医师',
                        id: 670
                    },
                    {
                        name: '传染病科医师',
                        id: 671
                    },
                    {
                        name: '急诊科医师',
                        id: 672
                    },
                    {
                        name: '康复科医师',
                        id: 673
                    },
                    {
                        name: '放射科医师',
                        id: 674
                    },
                    {
                        name: '激光科医生',
                        id: 675
                    },
                    {
                        name: '内窥镜医生',
                        id: 676
                    },
                    {
                        name: '核医学医师',
                        id: 677
                    },
                    {
                        name: '超声诊断科医师',
                        id: 678
                    },
                    {
                        name: '肿瘤科医师',
                        id: 679
                    },
                    {
                        name: '泌尿科医生',
                        id: 680
                    },
                    {
                        name: '肛肠科医师',
                        id: 681
                    },
                    {
                        name: '全科医师',
                        id: 682
                    },
                    {
                        name: '整形科医生',
                        id: 683
                    },
                    {
                        name: '输(采供)血医师',
                        id: 684
                    },
                    {
                        name: '流行病学医师',
                        id: 685
                    },
                    {
                        name: '放射卫生医师',
                        id: 686
                    },
                    {
                        name: '不孕不育科医生',
                        id: 687
                    },
                    {
                        name: '中医内科医师',
                        id: 688
                    },
                    {
                        name: '中医外科医师',
                        id: 689
                    },
                    {
                        name: '中医妇科医师',
                        id: 690
                    },
                    {
                        name: '中医儿科医师',
                        id: 691
                    },
                    {
                        name: '中医眼科医师',
                        id: 692
                    },
                    {
                        name: '中医皮肤科医师',
                        id: 693
                    },
                    {
                        name: '中医骨伤科医师',
                        id: 694
                    },
                    {
                        name: '中医肛肠科医师',
                        id: 695
                    },
                    {
                        name: '中医耳鼻喉科医师',
                        id: 696
                    },
                    {
                        name: '中西医结合医师',
                        id: 697
                    },
                    {
                        name: '针灸科医师',
                        id: 698
                    },
                    {
                        name: '推拿按摩科医师',
                        id: 699
                    },
                    {
                        name: '职业病医师',
                        id: 700
                    },
                    {
                        name: '劳动(职业)卫生医师',
                        id: 701
                    },

                ]
            },
            {
                name: '制药',
                content: [
                    {
                        name: '生化免疫检测员',
                        id: 702
                    },
                    {
                        name: '有机合成药物研究员',
                        id: 703
                    },
                    {
                        name: '医药技术研发员',
                        id: 704
                    },
                    {
                        name: '西药制剂员',
                        id: 705
                    },
                    {
                        name: '试剂开发工程师',
                        id: 706
                    },
                    {
                        name: '分析检验工程师',
                        id: 707
                    },
                    {
                        name: '药物制剂实验员',
                        id: 708
                    },
                    {
                        name: '中药制剂员',
                        id: 709
                    },
                    {
                        name: '化学检验员',
                        id: 710
                    },
                    {
                        name: '药物检验员',
                        id: 711
                    },
                    {
                        name: '微生物检验员',
                        id: 712
                    },
                    {
                        name: '医药代表',
                        id: 713
                    },

                ]
            },
            {
                name: '保健',
                content: [
                    {
                        name: '宠物医生',
                        id: 714
                    },
                    {
                        name: '健康管理师',
                        id: 715
                    },
                    {
                        name: '营养师',
                        id: 716
                    },
                    {
                        name: '健身顾问教练(各类)',
                        id: 717
                    },
                    {
                        name: '巡场教练游泳救护',
                        id: 718
                    },
                    {
                        name: '保健按摩师',
                        id: 719
                    },
                    {
                        name: '芳香保健师(SPA)',
                        id: 720
                    },

                ]
            },
            {
                name: '卫生服务',
                content: [
                    {
                        name: '卫生工程技师',
                        id: 721
                    },
                    {
                        name: '公卫检验技师',
                        id: 722
                    },
                    {
                        name: '院长·副院长',
                        id: 723
                    },
                    {
                        name: '医务部主任',
                        id: 724
                    },
                    {
                        name: '护理部主任',
                        id: 725
                    },
                    {
                        name: '药库主任',
                        id: 726
                    },
                    {
                        name: '各科室主任·副主任',
                        id: 727
                    },
                    {
                        name: '护士长',
                        id: 728
                    },
                    {
                        name: '临床研究员',
                        id: 729
                    },
                    {
                        name: '临床协调员',
                        id: 730
                    },
                    {
                        name: '环境卫生医师',
                        id: 731
                    },
                    {
                        name: '急诊护士',
                        id: 732
                    },
                    {
                        name: '学校卫生医师',
                        id: 733
                    },
                    {
                        name: '护理师',
                        id: 734
                    },
                    {
                        name: '母婴护理师',
                        id: 735
                    },
                    {
                        name: '病房护士',
                        id: 736
                    },
                    {
                        name: '门诊护士',
                        id: 737
                    },
                    {
                        name: '手术室护士',
                        id: 738
                    },
                    {
                        name: '供应室护士',
                        id: 739
                    },
                    {
                        name: '助产士',
                        id: 740
                    },
                    {
                        name: '社区护士',
                        id: 741
                    },
                    {
                        name: '各科室导医',
                        id: 742
                    },
                    {
                        name: '妇幼保健医师',
                        id: 743
                    },
                    {
                        name: '医疗救护员',
                        id: 744
                    },
                    {
                        name: '修脚师',
                        id: 745
                    },
                    {
                        name: '保育员',
                        id: 746
                    },
                    {
                        name: '养老护理员',
                        id: 747
                    },

                ]
            },

        ]
    },
    {
        width: 3,
        name: '咨询,专业服务',
        content: [
            {
                name: '咨询',
                content: [
                    {
                        name: '咨询总监',
                        id: 748
                    },
                    {
                        name: '咨询经理',
                        id: 749
                    },
                    {
                        name: '咨询顾问(各类)',
                        id: 750
                    },
                    {
                        name: '职业信息分析师',
                        id: 751
                    },
                    {
                        name: '职业指导师,职业规划师',
                        id: 752
                    },
                    {
                        name: '心理咨询师',
                        id: 753
                    },
                    {
                        name: '企管顾问',
                        id: 754
                    },
                    {
                        name: '出国咨询顾问',
                        id: 755
                    },
                    {
                        name: '婚礼顾问',
                        id: 756
                    },
                    {
                        name: '企业文化师',
                        id: 757
                    },
                    {
                        name: '策划师(各类)',
                        id: 758
                    },
                    {
                        name: '涉外咨询师(各类)',
                        id: 759
                    },

                ]
            },
            {
                name: '财会·审计',
                content: [
                    {
                        name: '首席财务官CFO',
                        id: 760
                    },
                    {
                        name: '财务总监',
                        id: 761
                    },
                    {
                        name: '财务经理·主管',
                        id: 762
                    },
                    {
                        name: '税务经理',
                        id: 763
                    },
                    {
                        name: '审计经理,主管',
                        id: 764
                    },
                    {
                        name: '成本经理·成本主管',
                        id: 765
                    },
                    {
                        name: '簿记师',
                        id: 766
                    },
                    {
                        name: '会计经理·会计主管',
                        id: 767
                    },
                    {
                        name: '预算员',
                        id: 768
                    },
                    {
                        name: '会计·会计师',
                        id: 769
                    },
                    {
                        name: '税务专员',
                        id: 770
                    },
                    {
                        name: '出纳员',
                        id: 771
                    },
                    {
                        name: '财务分析师',
                        id: 772
                    },
                    {
                        name: '成本管理员·成本控制师',
                        id: 773
                    },
                    {
                        name: '审计专员',
                        id: 774
                    },
                    {
                        name: '财务会计出纳',
                        id: 775
                    },
                    {
                        name: '统计专员',
                        id: 776
                    },
                    {
                        name: '结算员',
                        id: 777
                    },

                ]
            },
            {
                name: '法律',
                content: [
                    {
                        name: '法务人员',
                        id: 778
                    },
                    {
                        name: '法律顾问',
                        id: 779
                    },
                    {
                        name: '律师',
                        id: 780
                    },
                    {
                        name: '律师助理',
                        id: 781
                    },

                ]
            },

        ]
    },
    {
        width: 4,
        name: '政府,非营利机构',
        content: [
            {
                name: '政府',
                content: [
                    {
                        name: '公务员',
                        id: 782
                    },
                    {
                        name: '警察',
                        id: 783
                    },

                ]
            },

        ]
    },
    {
        width: 1,
        name: '通用',
        content: [
            {
                name: '行政管理·行政事务',
                content: [
                    {
                        name: '首席技术官CTO',
                        id: 784
                    },
                    {
                        name: '店长卖场经理',
                        id: 785
                    },
                    {
                        name: '首席执行官CEO',
                        id: 786
                    },
                    {
                        name: '首席运营官COO',
                        id: 787
                    },
                    {
                        name: '首席信息官CIO',
                        id: 788
                    },
                    {
                        name: '总经理·副总经理',
                        id: 789
                    },
                    {
                        name: '厂长·副厂长',
                        id: 790
                    },
                    {
                        name: '职业经理人',
                        id: 791
                    },
                    {
                        name: '项目总监经理',
                        id: 792
                    },
                    {
                        name: '项目管理师',
                        id: 793
                    },
                    {
                        name: '总裁助理·总经理助理',
                        id: 794
                    },
                    {
                        name: '收发员',
                        id: 795
                    },
                    {
                        name: '前台·总机·接待员',
                        id: 796
                    },
                    {
                        name: '图书情报·资料·文档管理员',
                        id: 797
                    },
                    {
                        name: '行政专员·助理',
                        id: 798
                    },
                    {
                        name: '行政总监',
                        id: 799
                    },
                    {
                        name: '行政经理·行政主管·办公室主任',
                        id: 800
                    },
                    {
                        name: '电脑操作员·打字员',
                        id: 801
                    },
                    {
                        name: '秘书·文员',
                        id: 802
                    },

                ]
            },
            {
                name: '人力资源管理',
                content: [
                    {
                        name: '人力资源总监',
                        id: 803
                    },
                    {
                        name: '人力资源经理·主管',
                        id: 804
                    },
                    {
                        name: '人力资源专员',
                        id: 805
                    },
                    {
                        name: '人力资源助理',
                        id: 806
                    },
                    {
                        name: '招聘经理·主管',
                        id: 807
                    },
                    {
                        name: '招聘专员助理',
                        id: 808
                    },
                    {
                        name: '薪酬福利经理主管',
                        id: 809
                    },
                    {
                        name: '薪酬福利专员助理',
                        id: 810
                    },
                    {
                        name: '绩效考核经理主管',
                        id: 811
                    },
                    {
                        name: '绩效考核专员助理',
                        id: 812
                    },
                    {
                        name: '员工关系经理主管',
                        id: 813
                    },
                    {
                        name: '员工关系专员助理',
                        id: 814
                    },
                    {
                        name: '猎头顾问',
                        id: 815
                    },

                ]
            },
            {
                name: '销售',
                content: [
                    {
                        name: '渠道代表·经销商',
                        id: 816
                    },
                    {
                        name: '销售助理',
                        id: 817
                    },
                    {
                        name: '招商经理',
                        id: 818
                    },
                    {
                        name: '销售行政经理主管',
                        id: 819
                    },
                    {
                        name: '电话销售',
                        id: 820
                    },
                    {
                        name: '销售总监',
                        id: 821
                    },
                    {
                        name: '销售经理·主管',
                        id: 822
                    },
                    {
                        name: '销售代表',
                        id: 823
                    },
                    {
                        name: '渠道总监·分销总监',
                        id: 824
                    },
                    {
                        name: '渠道分销经理·渠道分销主管',
                        id: 825
                    },
                    {
                        name: '售前售后技术服务经理·主管',
                        id: 826
                    },
                    {
                        name: '售前售后技术服务工程师',
                        id: 827
                    },
                    {
                        name: '售后客服经理·主管(非技术)',
                        id: 828
                    },
                    {
                        name: '售后客服专员(非技术)',
                        id: 829
                    },
                    {
                        name: '促销经理',
                        id: 830
                    },
                    {
                        name: '促销主管·督导',
                        id: 831
                    },
                    {
                        name: '促销员',
                        id: 832
                    },
                    {
                        name: '商场导购',
                        id: 833
                    },

                ]
            },
            {
                name: '其他通用',
                content: [
                    {
                        name: '品质经理·质量工程师',
                        id: 834
                    },
                    {
                        name: '技术文档工程师',
                        id: 835
                    },
                    {
                        name: '测试工程师',
                        id: 836
                    },
                    {
                        name: '工艺工程师',
                        id: 837
                    },
                    {
                        name: '维修工程师',
                        id: 838
                    },
                    {
                        name: '技术工程师',
                        id: 839
                    },
                    {
                        name: '工业工程师',
                        id: 840
                    },
                    {
                        name: '工业安全与健康工程师',
                        id: 841
                    },
                    {
                        name: '质量·品保·测试工程师',
                        id: 842
                    },
                    {
                        name: '产品认证工程师',
                        id: 843
                    },
                    {
                        name: '生产主管',
                        id: 844
                    },
                    {
                        name: '生产班长·拉长',
                        id: 845
                    },
                    {
                        name: '车间主任·工段长',
                        id: 846
                    },

                ]
            },

        ]
    },
    {
        width: 2,
        name: '广告,公关',
        content: [
            {
                name: '公关',
                content: [
                    {
                        name: '客户服务总监',
                        id: 915
                    },
                    {
                        name: '客户服务助理',
                        id: 916
                    },
                    {
                        name: '客户咨询热线·呼叫中心人员',
                        id: 917
                    },
                    {
                        name: '客户关系管理人员',
                        id: 918
                    },
                    {
                        name: '会务专员,经理',
                        id: 921
                    },
                    {
                        name: '媒介专员,经理',
                        id: 925
                    },
                    {
                        name: '公关专员,经理',
                        id: 926
                    },
                    {
                        name: '新闻发言人',
                        id: 927
                    },
                    {
                        name: '产品·品牌经理·主管',
                        id: 928
                    },
                    {
                        name: '产品·品牌专员',
                        id: 929
                    },

                ]
            },
            {
                name: '市场',
                content: [
                    {
                        name: '市场调查员',
                        id: 920
                    },
                    {
                        name: '市场专员,经理',
                        id: 923
                    },
                    {
                        name: '业务拓展(DE)经理',
                        id: 924
                    },

                ]
            },
            {
                name: '广告',
                content: [
                    {
                        name: '广告客户主管·专员',
                        id: 922
                    },
                    {
                        name: '广告客户经理',
                        id: 930
                    },
                    {
                        name: '美工',
                        id: 934
                    },
                    {
                        name: '广告创意·设计·策划经理',
                        id: 935
                    },
                    {
                        name: '广告创意·设计·策划主管',
                        id: 936
                    },
                    {
                        name: '广告创意设计师',
                        id: 937
                    },
                    {
                        name: '创意文案·制作',
                        id: 938
                    },
                    {
                        name: '广告设计师',
                        id: 939
                    },
                    {
                        name: '美术·艺术指导',
                        id: 940
                    },
                    {
                        name: '布景师',
                        id: 941
                    },

                ]
            },

        ]
    },

];
