var majorClass = [
        {
            type: 1,
            width: 3,
            name: "材料,能源类",
            content: [
                {
                    name: "材料类",
                    content: [
                        {
                            name: "材料工程技术",
                            id: 728
                        },
                        {
                            name: "复合材料加工与应用技术",
                            id: 727
                        },
                        {
                            name: "高分子材料应用技术",
                            id: 733
                        },
                        {
                            name: "建筑材料工程技术",
                            id: 735
                        },
                        {
                            name: "建筑装饰材料及检测",
                            id: 732
                        },
                        {
                            name: "金属材料与热处理技术",
                            id: 742
                        },
                        {
                            name: "磨料磨具制造",
                            id: 734
                        },
                        {
                            name: "首饰设计与工艺",
                            id: 726
                        },
                        {
                            name: "无机非金属材料工程技术",
                            id: 730
                        },
                        {
                            name: "冶金技术",
                            id: 725
                        },

                    ]
                },
                {
                    name: "电力技术类",
                    content: [
                        {
                            name: "电厂化学",
                            id: 755
                        },
                        {
                            name: "电厂热能动力装置",
                            id: 745
                        },
                        {
                            name: "电厂设备运行与维护",
                            id: 750
                        },
                        {
                            name: "电力客户服务与管理",
                            id: 758
                        },
                        {
                            name: "电力系统继电保护与自动化",
                            id: 756
                        },
                        {
                            name: "电网监控技术",
                            id: 749
                        },
                        {
                            name: "发电厂及电力系统",
                            id: 748
                        },
                        {
                            name: "高压输配电线路施工运行与维护",
                            id: 752
                        },
                        {
                            name: "供用电技术",
                            id: 751
                        },
                        {
                            name: "火电厂集控运行",
                            id: 753
                        },
                        {
                            name: "农村电气化技术",
                            id: 754
                        },
                        {
                            name: "输变电工程技术",
                            id: 760
                        },
                        {
                            name: "小型水电站及电力网",
                            id: 747
                        },

                    ]
                },
                {
                    name: "能源类",
                    content: [
                        {
                            name: "城市热能应用技术",
                            id: 737
                        },
                        {
                            name: "反应堆与加速器",
                            id: 746
                        },
                        {
                            name: "工业热工控制技术",
                            id: 743
                        },
                        {
                            name: "节能工程技术",
                            id: 744
                        },
                        {
                            name: "农村能源与环境技术",
                            id: 738
                        },
                        {
                            name: "热能动力设备与应用",
                            id: 736
                        },
                        {
                            name: "制冷与空调技术",
                            id: 739
                        },
                        {
                            name: "制冷与冷藏技术",
                            id: 741
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 2,
            name: "财经类",
            content: [
                {
                    name: "财务会计类",
                    content: [
                        {
                            name: "财务管理",
                            id: 436
                        },
                        {
                            name: "财务信息管理",
                            id: 1036
                        },
                        {
                            name: "会计",
                            id: 1047
                        },
                        {
                            name: "会计电算化",
                            id: 1029
                        },
                        {
                            name: "会计与审计",
                            id: 1046
                        },
                        {
                            name: "会计与统计核算",
                            id: 1030
                        },
                        {
                            name: "审计实务",
                            id: 1033
                        },
                        {
                            name: "统计实务",
                            id: 1031
                        },

                    ]
                },
                {
                    name: "财政金融类",
                    content: [
                        {
                            name: "保险实务",
                            id: 1019
                        },
                        {
                            name: "财政",
                            id: 1011
                        },
                        {
                            name: "产权交易与实务",
                            id: 1022
                        },
                        {
                            name: "国际金融",
                            id: 1018
                        },
                        {
                            name: "机动车保险实务",
                            id: 1025
                        },
                        {
                            name: "金融保险",
                            id: 1013
                        },
                        {
                            name: "金融管理与实务",
                            id: 1012
                        },
                        {
                            name: "金融与证券",
                            id: 1024
                        },
                        {
                            name: "农村合作金融",
                            id: 1027
                        },
                        {
                            name: "税务",
                            id: 1017
                        },
                        {
                            name: "投资与理财",
                            id: 1021
                        },
                        {
                            name: "信用管理",
                            id: 32
                        },
                        {
                            name: "医疗保险实务",
                            id: 1020
                        },
                        {
                            name: "证券投资与管理",
                            id: 1016
                        },
                        {
                            name: "证券与期货",
                            id: 1023
                        },
                        {
                            name: "资产评估与管理",
                            id: 1015
                        },

                    ]
                },
                {
                    name: "工商管理类",
                    content: [
                        {
                            name: "采购供应管理",
                            id: 1054
                        },
                        {
                            name: "工商行政管理",
                            id: 1050
                        },
                        {
                            name: "工商企业管理",
                            id: 1045
                        },
                        {
                            name: "连锁经营管理",
                            id: 1053
                        },
                        {
                            name: "企业资源计划管理",
                            id: 1049
                        },
                        {
                            name: "商务管理",
                            id: 1056
                        },
                        {
                            name: "物流管理",
                            id: 457
                        },
                        {
                            name: "项目管理",
                            id: 1059
                        },
                        {
                            name: "招商管理",
                            id: 1052
                        },

                    ]
                },
                {
                    name: "经济贸易类",
                    content: [
                        {
                            name: "国际经济与贸易",
                            id: 16
                        },
                        {
                            name: "国际贸易实务",
                            id: 1034
                        },
                        {
                            name: "国际商务",
                            id: 434
                        },
                        {
                            name: "经济管理",
                            id: 1040
                        },
                        {
                            name: "经济信息管理",
                            id: 1032
                        },
                        {
                            name: "商务经纪与代理",
                            id: 1038
                        },

                    ]
                },
                {
                    name: "市场营销类",
                    content: [
                        {
                            name: "电子商务",
                            id: 466
                        },
                        {
                            name: "广告经营与管理",
                            id: 1044
                        },
                        {
                            name: "市场开发与营销",
                            id: 1041
                        },
                        {
                            name: "市场营销",
                            id: 431
                        },
                        {
                            name: "医药营销",
                            id: 1043
                        },
                        {
                            name: "营销与策划",
                            id: 1042
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 3,
            name: "电子信息类",
            content: [
                {
                    name: "电子信息类",
                    content: [
                        {
                            name: "电光源技术",
                            id: 922
                        },
                        {
                            name: "电子表面组装技术",
                            id: 926
                        },
                        {
                            name: "电子测量技术与仪器",
                            id: 904
                        },
                        {
                            name: "电子产品质量检测",
                            id: 915
                        },
                        {
                            name: "电子电路设计与工艺",
                            id: 927
                        },
                        {
                            name: "电子工艺与管理",
                            id: 913
                        },
                        {
                            name: "电子设备与运行管理",
                            id: 900
                        },
                        {
                            name: "电子声像技术",
                            id: 907
                        },
                        {
                            name: "电子信息工程技术",
                            id: 901
                        },
                        {
                            name: "电子信息技术及产品营销",
                            id: 921
                        },
                        {
                            name: "电子仪器仪表与维修",
                            id: 906
                        },
                        {
                            name: "飞行器电子装配技术",
                            id: 918
                        },
                        {
                            name: "光电子技术",
                            id: 914
                        },
                        {
                            name: "广播电视网络技术",
                            id: 908
                        },
                        {
                            name: "嵌入式系统工程",
                            id: 923
                        },
                        {
                            name: "数字媒体技术",
                            id: 241
                        },
                        {
                            name: "图文信息技术",
                            id: 920
                        },
                        {
                            name: "微电子技术",
                            id: 905
                        },
                        {
                            name: "无损检测技术",
                            id: 924
                        },
                        {
                            name: "无线电技术",
                            id: 909
                        },
                        {
                            name: "信息安全技术",
                            id: 911
                        },
                        {
                            name: "信息技术应用",
                            id: 912
                        },
                        {
                            name: "液晶显示与光电技术",
                            id: 925
                        },
                        {
                            name: "音响工程",
                            id: 916
                        },
                        {
                            name: "应用电子技术",
                            id: 903
                        },
                        {
                            name: "有线电视工程技术",
                            id: 919
                        },
                        {
                            name: "智能产品开发",
                            id: 910
                        },

                    ]
                },
                {
                    name: "计算机类",
                    content: [
                        {
                            name: "动漫设计与制作",
                            id: 888
                        },
                        {
                            name: "广告媒体开发",
                            id: 897
                        },
                        {
                            name: "航空计算机技术与应用",
                            id: 891
                        },
                        {
                            name: "计算机多媒体技术",
                            id: 880
                        },
                        {
                            name: "计算机网络技术",
                            id: 879
                        },
                        {
                            name: "计算机网络与安全管理",
                            id: 889
                        },
                        {
                            name: "计算机系统维护",
                            id: 883
                        },
                        {
                            name: "计算机信息管理",
                            id: 882
                        },
                        {
                            name: "计算机音乐制作",
                            id: 894
                        },
                        {
                            name: "计算机应用技术",
                            id: 877
                        },
                        {
                            name: "计算机硬件与外设",
                            id: 886
                        },
                        {
                            name: "嵌入式技术与应用",
                            id: 896
                        },
                        {
                            name: "软件测试技术",
                            id: 898
                        },
                        {
                            name: "软件技术",
                            id: 892
                        },
                        {
                            name: "软件开发与项目管理",
                            id: 893
                        },
                        {
                            name: "三维动画设计",
                            id: 899
                        },
                        {
                            name: "数据通信与网络系统",
                            id: 895
                        },
                        {
                            name: "图形图像制作",
                            id: 885
                        },
                        {
                            name: "网络系统管理",
                            id: 884
                        },
                        {
                            name: "网站规划与开发技术",
                            id: 890
                        },
                        {
                            name: "游戏软件",
                            id: 902
                        },

                    ]
                },
                {
                    name: "通信类",
                    content: [
                        {
                            name: "程控交换技术",
                            id: 929
                        },
                        {
                            name: "电信商务",
                            id: 940
                        },
                        {
                            name: "光纤通信",
                            id: 936
                        },
                        {
                            name: "计算机通信",
                            id: 935
                        },
                        {
                            name: "通信技术",
                            id: 933
                        },
                        {
                            name: "通信网络与设备",
                            id: 943
                        },
                        {
                            name: "通信系统运行管理",
                            id: 932
                        },
                        {
                            name: "通信线路",
                            id: 931
                        },
                        {
                            name: "通讯工程设计与管理",
                            id: 937
                        },
                        {
                            name: "卫星数字技术",
                            id: 934
                        },
                        {
                            name: "移动通信技术",
                            id: 930
                        },
                        {
                            name: "邮政通信",
                            id: 938
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 2,
            name: "法律类",
            content: [
                {
                    name: "法律实务类",
                    content: [
                        {
                            name: "法律事务",
                            id: 1291
                        },
                        {
                            name: "法律文秘",
                            id: 1289
                        },
                        {
                            name: "海关国际法律条约与公约",
                            id: 1302
                        },
                        {
                            name: "检查事务",
                            id: 1295
                        },
                        {
                            name: "经济法律事务",
                            id: 1299
                        },
                        {
                            name: "书记官",
                            id: 1290
                        },
                        {
                            name: "司法警务",
                            id: 1288
                        },
                        {
                            name: "司法助理",
                            id: 1294
                        },

                    ]
                },
                {
                    name: "法律执行类",
                    content: [
                        {
                            name: "行政执行",
                            id: 1298
                        },
                        {
                            name: "监狱管理",
                            id: 1297
                        },
                        {
                            name: "劳教管理",
                            id: 1300
                        },
                        {
                            name: "民事执行",
                            id: 1296
                        },
                        {
                            name: "刑事执行",
                            id: 1293
                        },

                    ]
                },
                {
                    name: "司法技术类",
                    content: [
                        {
                            name: "安全防范技术",
                            id: 1306
                        },
                        {
                            name: "毒品犯罪矫治",
                            id: 1318
                        },
                        {
                            name: "司法会计",
                            id: 1305
                        },
                        {
                            name: "司法鉴定技术",
                            id: 1303
                        },
                        {
                            name: "司法信息安全",
                            id: 1304
                        },
                        {
                            name: "司法信息技术",
                            id: 1311
                        },
                        {
                            name: "刑事侦查技术",
                            id: 1301
                        },
                        {
                            name: "应用法制心理技术",
                            id: 1307
                        },
                        {
                            name: "罪犯心理测量与矫正技术",
                            id: 1312
                        },

                    ]
                },

            ]
        },
        {
            type: 0,
            width: 1,
            name: "法学",
            content: [
                {
                    name: "法学类",
                    content: [
                        {
                            name: "法学",
                            id: 18
                        },
                        {
                            name: "监狱学",
                            id: 20
                        },
                        {
                            name: "知识产权",
                            id: 19
                        },

                    ]
                },
                {
                    name: "公安学类",
                    content: [
                        {
                            name: "边防管理",
                            id: 41
                        },
                        {
                            name: "边防指挥",
                            id: 40
                        },
                        {
                            name: "犯罪学",
                            id: 46
                        },
                        {
                            name: "公安管理学",
                            id: 48
                        },
                        {
                            name: "公安情报学",
                            id: 47
                        },
                        {
                            name: "国内安全保卫",
                            id: 52
                        },
                        {
                            name: "禁毒学",
                            id: 37
                        },
                        {
                            name: "经济犯罪侦查",
                            id: 44
                        },
                        {
                            name: "警犬技术",
                            id: 43
                        },
                        {
                            name: "警卫学",
                            id: 42
                        },
                        {
                            name: "警务指挥与战术",
                            id: 55
                        },
                        {
                            name: "涉外警务",
                            id: 49
                        },
                        {
                            name: "消防指挥",
                            id: 45
                        },
                        {
                            name: "侦查学",
                            id: 35
                        },
                        {
                            name: "治安学",
                            id: 34
                        },

                    ]
                },
                {
                    name: "马克思主义理论类",
                    content: [
                        {
                            name: "科学社会主义",
                            id: 36
                        },
                        {
                            name: "思想政治教育",
                            id: 50
                        },
                        {
                            name: "中国共产党历史",
                            id: 39
                        },

                    ]
                },
                {
                    name: "民族学类",
                    content: [
                        {
                            name: "民族学",
                            id: 31
                        },

                    ]
                },
                {
                    name: "社会学类",
                    content: [
                        {
                            name: "家政学",
                            id: 28
                        },
                        {
                            name: "女性学",
                            id: 38
                        },
                        {
                            name: "人类学",
                            id: 30
                        },
                        {
                            name: "社会工作",
                            id: 33
                        },
                        {
                            name: "社会学",
                            id: 25
                        },

                    ]
                },
                {
                    name: "政治学类",
                    content: [
                        {
                            name: "国际事务与国际关系",
                            id: 26
                        },
                        {
                            name: "国际政治",
                            id: 23
                        },
                        {
                            name: "外交学",
                            id: 27
                        },
                        {
                            name: "政治学、经济学与哲学",
                            id: 24
                        },
                        {
                            name: "政治学与行政学",
                            id: 22
                        },

                    ]
                },

            ]
        },
        {
            type: 0,
            width: 1,
            name: "工学",
            content: [
                {
                    name: "安全科学与工程类",
                    content: [
                        {
                            name: "安全工程",
                            id: 356
                        },

                    ]
                },
                {
                    name: "兵器类",
                    content: [
                        {
                            name: "弹药工程与爆炸技术",
                            id: 307
                        },
                        {
                            name: "探测制导与控制技术",
                            id: 308
                        },
                        {
                            name: "特种能源技术与工程",
                            id: 309
                        },
                        {
                            name: "武器发射工程",
                            id: 301
                        },
                        {
                            name: "武器系统与工程",
                            id: 303
                        },
                        {
                            name: "信息对抗技术",
                            id: 314
                        },
                        {
                            name: "装甲车辆工程",
                            id: 304
                        },

                    ]
                },
                {
                    name: "材料类",
                    content: [
                        {
                            name: "宝石及材料工艺学",
                            id: 211
                        },
                        {
                            name: "材料化学",
                            id: 207
                        },
                        {
                            name: "材料科学与工程",
                            id: 202
                        },
                        {
                            name: "材料物理",
                            id: 201
                        },
                        {
                            name: "粉体材料科学与工程",
                            id: 208
                        },
                        {
                            name: "复合材料与工程",
                            id: 205
                        },
                        {
                            name: "高分子材料与工程",
                            id: 218
                        },
                        {
                            name: "功能材料",
                            id: 209
                        },
                        {
                            name: "焊接技术与工程",
                            id: 213
                        },
                        {
                            name: "金属材料工程",
                            id: 203
                        },
                        {
                            name: "纳米材料与技术",
                            id: 216
                        },
                        {
                            name: "无机非金属材料工程",
                            id: 210
                        },
                        {
                            name: "新能源材料与器件",
                            id: 212
                        },
                        {
                            name: "冶金工程",
                            id: 200
                        },

                    ]
                },
                {
                    name: "测绘类",
                    content: [
                        {
                            name: "测绘工程",
                            id: 258
                        },
                        {
                            name: "导航工程",
                            id: 261
                        },
                        {
                            name: "地理国情监测",
                            id: 263
                        },
                        {
                            name: "遥感科学与技术",
                            id: 259
                        },

                    ]
                },
                {
                    name: "地质类",
                    content: [
                        {
                            name: "地下水科学与工程",
                            id: 272
                        },
                        {
                            name: "地质工程",
                            id: 267
                        },
                        {
                            name: "勘查技术与工程",
                            id: 266
                        },
                        {
                            name: "资源勘查工程",
                            id: 275
                        },

                    ]
                },
                {
                    name: "电气类",
                    content: [
                        {
                            name: "电气工程及其自动化",
                            id: 217
                        },
                        {
                            name: "电气工程与智能控制",
                            id: 219
                        },
                        {
                            name: "光源与照明",
                            id: 221
                        },
                        {
                            name: "智能电网信息工程",
                            id: 215
                        },

                    ]
                },
                {
                    name: "电子信息类",
                    content: [
                        {
                            name: "电波传播与天线",
                            id: 235
                        },
                        {
                            name: "电磁场与无线技术",
                            id: 233
                        },
                        {
                            name: "电信工程及管理",
                            id: 245
                        },
                        {
                            name: "电子封装技术",
                            id: 229
                        },
                        {
                            name: "电子科学与技术",
                            id: 220
                        },
                        {
                            name: "电子信息工程",
                            id: 224
                        },
                        {
                            name: "电子信息科学与技术",
                            id: 237
                        },
                        {
                            name: "光电信息科学与工程",
                            id: 225
                        },
                        {
                            name: "广播电视工程",
                            id: 226
                        },
                        {
                            name: "集成电路设计与集成系统",
                            id: 232
                        },
                        {
                            name: "水声工程",
                            id: 230
                        },
                        {
                            name: "通信工程",
                            id: 223
                        },
                        {
                            name: "微电子科学与工程",
                            id: 227
                        },
                        {
                            name: "信息工程",
                            id: 238
                        },
                        {
                            name: "医学信息工程",
                            id: 231
                        },
                        {
                            name: "应用电子技术教育",
                            id: 234
                        },

                    ]
                },
                {
                    name: "纺织类",
                    content: [
                        {
                            name: "纺织工程",
                            id: 282
                        },
                        {
                            name: "非织造材料与工程",
                            id: 278
                        },
                        {
                            name: "服装设计与工程",
                            id: 292
                        },
                        {
                            name: "服装设计与工艺教育",
                            id: 279
                        },

                    ]
                },
                {
                    name: "公安技术类",
                    content: [
                        {
                            name: "安全防范工程",
                            id: 352
                        },
                        {
                            name: "公安视听技术",
                            id: 350
                        },
                        {
                            name: "核生化消防",
                            id: 353
                        },
                        {
                            name: "火灾勘查",
                            id: 351
                        },
                        {
                            name: "交通管理工程",
                            id: 347
                        },
                        {
                            name: "抢险救援指挥与技术",
                            id: 354
                        },
                        {
                            name: "网络安全与执法",
                            id: 349
                        },
                        {
                            name: "消防工程",
                            id: 346
                        },
                        {
                            name: "刑事科学技术",
                            id: 348
                        },

                    ]
                },
                {
                    name: "海洋工程类",
                    content: [
                        {
                            name: "船舶与海洋工程",
                            id: 295
                        },
                        {
                            name: "海洋工程与技术",
                            id: 297
                        },
                        {
                            name: "海洋资源开发技术",
                            id: 305
                        },

                    ]
                },
                {
                    name: "航空航天类",
                    content: [
                        {
                            name: "飞行器动力工程",
                            id: 298
                        },
                        {
                            name: "飞行器环境与生命保障工程",
                            id: 300
                        },
                        {
                            name: "飞行器设计与工程",
                            id: 294
                        },
                        {
                            name: "飞行器适航技术",
                            id: 302
                        },
                        {
                            name: "飞行器制造工程",
                            id: 296
                        },
                        {
                            name: "飞行器质量与可靠性",
                            id: 306
                        },
                        {
                            name: "航空航天工程",
                            id: 299
                        },

                    ]
                },
                {
                    name: "核工程类",
                    content: [
                        {
                            name: "辐射防护与核安全",
                            id: 312
                        },
                        {
                            name: "工程物理",
                            id: 311
                        },
                        {
                            name: "核工程与核技术",
                            id: 317
                        },
                        {
                            name: "核化工与核燃料工程",
                            id: 310
                        },

                    ]
                },
                {
                    name: "化工与制药类",
                    content: [
                        {
                            name: "化学工程与工业生物工程",
                            id: 273
                        },
                        {
                            name: "化学工程与工艺",
                            id: 262
                        },
                        {
                            name: "能源化学工程",
                            id: 264
                        },
                        {
                            name: "制药工程",
                            id: 268
                        },
                        {
                            name: "资源循环科学与工程",
                            id: 265
                        },

                    ]
                },
                {
                    name: "机械类",
                    content: [
                        {
                            name: "材料成型及控制工程",
                            id: 194
                        },
                        {
                            name: "车辆工程",
                            id: 190
                        },
                        {
                            name: "工业设计",
                            id: 197
                        },
                        {
                            name: "过程装备与控制工程",
                            id: 195
                        },
                        {
                            name: "机电技术教育",
                            id: 206
                        },
                        {
                            name: "机械电子工程",
                            id: 192
                        },
                        {
                            name: "机械工程",
                            id: 187
                        },
                        {
                            name: "机械工艺技术",
                            id: 196
                        },
                        {
                            name: "机械设计制造及其自动化",
                            id: 191
                        },
                        {
                            name: "汽车服务工程",
                            id: 193
                        },
                        {
                            name: "汽车维修工程教育",
                            id: 204
                        },
                        {
                            name: "微机电系统工程",
                            id: 199
                        },

                    ]
                },
                {
                    name: "环境科学与工程类",
                    content: [
                        {
                            name: "环保设备工程",
                            id: 334
                        },
                        {
                            name: "环境工程",
                            id: 324
                        },
                        {
                            name: "环境科学",
                            id: 325
                        },
                        {
                            name: "环境科学与工程",
                            id: 321
                        },
                        {
                            name: "环境生态工程",
                            id: 323
                        },
                        {
                            name: "水质科学与技术",
                            id: 326
                        },
                        {
                            name: "资源环境科学",
                            id: 328
                        },

                    ]
                },
                {
                    name: "计算机类",
                    content: [
                        {
                            name: "电子与计算机工程",
                            id: 246
                        },
                        {
                            name: "计算机科学与技术",
                            id: 257
                        },
                        {
                            name: "空间信息与数字技术",
                            id: 250
                        },
                        {
                            name: "软件工程",
                            id: 243
                        },
                        {
                            name: "数字媒体技术",
                            id: 241
                        },
                        {
                            name: "网络工程",
                            id: 240
                        },
                        {
                            name: "物联网工程",
                            id: 242
                        },
                        {
                            name: "信息安全",
                            id: 239
                        },
                        {
                            name: "智能科学与技术",
                            id: 244
                        },

                    ]
                },
                {
                    name: "建筑类",
                    content: [
                        {
                            name: "城乡规划",
                            id: 340
                        },
                        {
                            name: "风景园林",
                            id: 341
                        },
                        {
                            name: "建筑学",
                            id: 339
                        },
                        {
                            name: "历史建筑保护工程",
                            id: 342
                        },

                    ]
                },
                {
                    name: "交通运输类",
                    content: [
                        {
                            name: "船舶电子电气工程",
                            id: 289
                        },
                        {
                            name: "飞行技术",
                            id: 286
                        },
                        {
                            name: "航海技术",
                            id: 293
                        },
                        {
                            name: "交通工程",
                            id: 288
                        },
                        {
                            name: "交通设备与控制工程",
                            id: 291
                        },
                        {
                            name: "交通运输",
                            id: 283
                        },
                        {
                            name: "救助与打捞工程",
                            id: 287
                        },
                        {
                            name: "轮机工程",
                            id: 284
                        },

                    ]
                },
                {
                    name: "矿业类",
                    content: [
                        {
                            name: "采矿工程",
                            id: 269
                        },
                        {
                            name: "海洋油气工程",
                            id: 277
                        },
                        {
                            name: "矿物加工工程",
                            id: 270
                        },
                        {
                            name: "矿物资源工程",
                            id: 285
                        },
                        {
                            name: "石油工程",
                            id: 274
                        },
                        {
                            name: "油气储运工程",
                            id: 276
                        },

                    ]
                },
                {
                    name: "力学类",
                    content: [
                        {
                            name: "工程力学",
                            id: 189
                        },
                        {
                            name: "理论与应用力学",
                            id: 186
                        },

                    ]
                },
                {
                    name: "林业工程类",
                    content: [
                        {
                            name: "林产化工",
                            id: 322
                        },
                        {
                            name: "木材科学与工程",
                            id: 319
                        },
                        {
                            name: "森林工程",
                            id: 320
                        },

                    ]
                },
                {
                    name: "能源动力类",
                    content: [
                        {
                            name: "能源与动力工程",
                            id: 214
                        },
                        {
                            name: "能源与环境系统工程",
                            id: 228
                        },
                        {
                            name: "新能源科学与工程",
                            id: 222
                        },

                    ]
                },
                {
                    name: "农业工程类",
                    content: [
                        {
                            name: "农业电气化",
                            id: 318
                        },
                        {
                            name: "农业工程",
                            id: 313
                        },
                        {
                            name: "农业机械化及其自动化",
                            id: 315
                        },
                        {
                            name: "农业建筑环境与能源工程",
                            id: 316
                        },
                        {
                            name: "农业水利工程",
                            id: 330
                        },

                    ]
                },
                {
                    name: "轻工类",
                    content: [
                        {
                            name: "包装工程",
                            id: 281
                        },
                        {
                            name: "轻化工程",
                            id: 280
                        },
                        {
                            name: "印刷工程",
                            id: 290
                        },

                    ]
                },
                {
                    name: "生物工程类",
                    content: [
                        {
                            name: "生物工程",
                            id: 343
                        },
                        {
                            name: "生物制药",
                            id: 345
                        },

                    ]
                },
                {
                    name: "生物医学工程类",
                    content: [
                        {
                            name: "假肢矫形工程",
                            id: 329
                        },
                        {
                            name: "生物医学工程",
                            id: 331
                        },

                    ]
                },
                {
                    name: "食品科学与工程类",
                    content: [
                        {
                            name: "粮食工程",
                            id: 337
                        },
                        {
                            name: "酿酒工程",
                            id: 338
                        },
                        {
                            name: "烹饪与营养教育",
                            id: 344
                        },
                        {
                            name: "葡萄与葡萄酒工程",
                            id: 335
                        },
                        {
                            name: "乳品工程",
                            id: 332
                        },
                        {
                            name: "食品科学与工程",
                            id: 327
                        },
                        {
                            name: "食品营养与检验教育",
                            id: 336
                        },
                        {
                            name: "食品质量与安全",
                            id: 333
                        },

                    ]
                },
                {
                    name: "水利类",
                    content: [
                        {
                            name: "港口航道与海岸工程",
                            id: 256
                        },
                        {
                            name: "水利水电工程",
                            id: 253
                        },
                        {
                            name: "水文与水资源工程",
                            id: 254
                        },
                        {
                            name: "水务工程",
                            id: 260
                        },

                    ]
                },
                {
                    name: "土木类",
                    content: [
                        {
                            name: "城市地下空间工程",
                            id: 251
                        },
                        {
                            name: "道路桥梁与渡河工程",
                            id: 255
                        },
                        {
                            name: "给排水科学与工程",
                            id: 247
                        },
                        {
                            name: "建筑电气与智能化",
                            id: 252
                        },
                        {
                            name: "建筑环境与能源应用工程",
                            id: 248
                        },
                        {
                            name: "土木工程",
                            id: 249
                        },

                    ]
                },
                {
                    name: "仪器类",
                    content: [
                        {
                            name: "测控技术与仪器",
                            id: 198
                        },

                    ]
                },
                {
                    name: "自动化类",
                    content: [
                        {
                            name: "轨道交通信号与控制",
                            id: 236
                        },
                        {
                            name: "自动化",
                            id: 271
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 2,
            name: "公安类",
            content: [
                {
                    name: "部队基础工作类",
                    content: [
                        {
                            name: "部队财务会计",
                            id: 1292
                        },
                        {
                            name: "部队后勤管理",
                            id: 1285
                        },
                        {
                            name: "部队政治工作",
                            id: 1286
                        },

                    ]
                },
                {
                    name: "公安管理类",
                    content: [
                        {
                            name: "安全保卫",
                            id: 959
                        },
                        {
                            name: "边防检查",
                            id: 1270
                        },
                        {
                            name: "边境管理",
                            id: 1269
                        },
                        {
                            name: "防火管理",
                            id: 1267
                        },
                        {
                            name: "公共安全管理",
                            id: 1277
                        },
                        {
                            name: "交通管理",
                            id: 453
                        },
                        {
                            name: "禁毒",
                            id: 1272
                        },
                        {
                            name: "经济犯罪侦查",
                            id: 44
                        },
                        {
                            name: "警察管理",
                            id: 1268
                        },
                        {
                            name: "警卫",
                            id: 1260
                        },
                        {
                            name: "森林消防",
                            id: 1271
                        },
                        {
                            name: "信息网络安全监察",
                            id: 1266
                        },
                        {
                            name: "侦查",
                            id: 1263
                        },
                        {
                            name: "治安管理",
                            id: 1261
                        },

                    ]
                },
                {
                    name: "公安技术类",
                    content: [
                        {
                            name: "边防机要",
                            id: 1284
                        },
                        {
                            name: "船艇动力管理",
                            id: 1279
                        },
                        {
                            name: "船艇技术",
                            id: 1283
                        },
                        {
                            name: "警犬技术",
                            id: 43
                        },
                        {
                            name: "刑事技术",
                            id: 1287
                        },

                    ]
                },
                {
                    name: "公安指挥类",
                    content: [
                        {
                            name: "边防船艇指挥",
                            id: 1276
                        },
                        {
                            name: "边防通信指挥",
                            id: 1280
                        },
                        {
                            name: "边防指挥",
                            id: 40
                        },
                        {
                            name: "参谋业务",
                            id: 1278
                        },
                        {
                            name: "警察指挥与战术",
                            id: 1273
                        },
                        {
                            name: "抢险救援",
                            id: 1282
                        },
                        {
                            name: "消防指挥",
                            id: 45
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 3,
            name: "公共事业类",
            content: [
                {
                    name: "公共服务类",
                    content: [
                        {
                            name: "家政服务",
                            id: 1128
                        },
                        {
                            name: "戒毒康复",
                            id: 1133
                        },
                        {
                            name: "科技成果中介服务",
                            id: 1130
                        },
                        {
                            name: "老年服务与管理",
                            id: 1127
                        },
                        {
                            name: "社区康复",
                            id: 1129
                        },
                        {
                            name: "现代殡仪技术与管理",
                            id: 1131
                        },
                        {
                            name: "心理咨询",
                            id: 1141
                        },
                        {
                            name: "职业中介服务",
                            id: 1132
                        },

                    ]
                },
                {
                    name: "公共管理类",
                    content: [
                        {
                            name: "电子政务",
                            id: 1123
                        },
                        {
                            name: "公共事务管理",
                            id: 1116
                        },
                        {
                            name: "国际质量管理体系认证",
                            id: 1126
                        },
                        {
                            name: "国土资源管理",
                            id: 1119
                        },
                        {
                            name: "海关管理",
                            id: 450
                        },
                        {
                            name: "行政管理",
                            id: 451
                        },
                        {
                            name: "环境规划与管理",
                            id: 1121
                        },
                        {
                            name: "劳动与社会保障",
                            id: 452
                        },
                        {
                            name: "民政管理",
                            id: 1112
                        },
                        {
                            name: "人力资源管理",
                            id: 447
                        },
                        {
                            name: "社会救助",
                            id: 1125
                        },

                    ]
                },
                {
                    name: "公共事业类",
                    content: [
                        {
                            name: "妇女工作与管理",
                            id: 1113
                        },
                        {
                            name: "公共关系",
                            id: 1110
                        },
                        {
                            name: "青少年工作与管理",
                            id: 1108
                        },
                        {
                            name: "人民武装",
                            id: 1124
                        },
                        {
                            name: "商检技术",
                            id: 1120
                        },
                        {
                            name: "社会福利事业管理",
                            id: 1107
                        },
                        {
                            name: "社会工作",
                            id: 33
                        },
                        {
                            name: "社区管理与服务",
                            id: 1106
                        },
                        {
                            name: "涉外事务管理",
                            id: 1111
                        },
                        {
                            name: "体育场馆管理",
                            id: 1115
                        },

                    ]
                },

            ]
        },
        {
            type: 0,
            width: 2,
            name: "管理学",
            content: [
                {
                    name: "电子商务类",
                    content: [
                        {
                            name: "电子商务",
                            id: 466
                        },
                        {
                            name: "电子商务及法律",
                            id: 471
                        },

                    ]
                },
                {
                    name: "工商管理类",
                    content: [
                        {
                            name: "财务管理",
                            id: 436
                        },
                        {
                            name: "财务会计教育",
                            id: 440
                        },
                        {
                            name: "工商管理",
                            id: 430
                        },
                        {
                            name: "国际商务",
                            id: 434
                        },
                        {
                            name: "会计学",
                            id: 433
                        },
                        {
                            name: "劳动关系",
                            id: 438
                        },
                        {
                            name: "人力资源管理",
                            id: 447
                        },
                        {
                            name: "审计学",
                            id: 437
                        },
                        {
                            name: "市场营销",
                            id: 431
                        },
                        {
                            name: "市场营销教育",
                            id: 444
                        },
                        {
                            name: "体育经济与管理",
                            id: 441
                        },
                        {
                            name: "文化产业管理",
                            id: 443
                        },
                        {
                            name: "物业管理",
                            id: 446
                        },
                        {
                            name: "资产评估",
                            id: 442
                        },

                    ]
                },
                {
                    name: "工业工程类",
                    content: [
                        {
                            name: "标准化工程",
                            id: 472
                        },
                        {
                            name: "工业工程",
                            id: 464
                        },
                        {
                            name: "质量管理工程",
                            id: 465
                        },

                    ]
                },
                {
                    name: "公共管理类",
                    content: [
                        {
                            name: "城市管理",
                            id: 454
                        },
                        {
                            name: "公共关系学",
                            id: 456
                        },
                        {
                            name: "公共事业管理",
                            id: 449
                        },
                        {
                            name: "海关管理",
                            id: 450
                        },
                        {
                            name: "海事管理",
                            id: 458
                        },
                        {
                            name: "行政管理",
                            id: 451
                        },
                        {
                            name: "交通管理",
                            id: 453
                        },
                        {
                            name: "劳动与社会保障",
                            id: 452
                        },
                        {
                            name: "土地资源管理",
                            id: 459
                        },

                    ]
                },
                {
                    name: "管理科学与工程类",
                    content: [
                        {
                            name: "保密管理",
                            id: 435
                        },
                        {
                            name: "房地产开发与管理",
                            id: 428
                        },
                        {
                            name: "工程管理",
                            id: 425
                        },
                        {
                            name: "工程造价",
                            id: 432
                        },
                        {
                            name: "管理科学",
                            id: 429
                        },
                        {
                            name: "信息管理与信息系统",
                            id: 427
                        },

                    ]
                },
                {
                    name: "旅游管理类",
                    content: [
                        {
                            name: "会展经济与管理",
                            id: 468
                        },
                        {
                            name: "酒店管理",
                            id: 479
                        },
                        {
                            name: "旅游管理",
                            id: 467
                        },
                        {
                            name: "旅游管理与服务教育",
                            id: 469
                        },

                    ]
                },
                {
                    name: "农业经济管理类",
                    content: [
                        {
                            name: "农村区域发展",
                            id: 448
                        },
                        {
                            name: "农林经济管理",
                            id: 445
                        },

                    ]
                },
                {
                    name: "图书情报与档案管理类",
                    content: [
                        {
                            name: "档案学",
                            id: 463
                        },
                        {
                            name: "图书馆学",
                            id: 462
                        },
                        {
                            name: "信息资源管理",
                            id: 455
                        },

                    ]
                },
                {
                    name: "物流管理与工程类",
                    content: [
                        {
                            name: "采购管理",
                            id: 461
                        },
                        {
                            name: "物流工程",
                            id: 460
                        },
                        {
                            name: "物流管理",
                            id: 457
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 4,
            name: "环保气象安全类",
            content: [
                {
                    name: "安全类",
                    content: [
                        {
                            name: "安全保卫",
                            id: 959
                        },
                        {
                            name: "安全技术管理",
                            id: 952
                        },
                        {
                            name: "城市应急救援辅助决策技术",
                            id: 955
                        },
                        {
                            name: "工业环保与安全技术",
                            id: 951
                        },
                        {
                            name: "救援技术",
                            id: 958
                        },
                        {
                            name: "信息技术与地球物理",
                            id: 957
                        },

                    ]
                },
                {
                    name: "环保类",
                    content: [
                        {
                            name: "城市检测与工程技术",
                            id: 942
                        },
                        {
                            name: "城市水净化技术",
                            id: 946
                        },
                        {
                            name: "环境工程技术",
                            id: 948
                        },
                        {
                            name: "环境监测与评价",
                            id: 939
                        },
                        {
                            name: "环境监测与治理技术",
                            id: 947
                        },
                        {
                            name: "农业环境保护技术",
                            id: 941
                        },
                        {
                            name: "室内检测与控制技术",
                            id: 954
                        },
                        {
                            name: "水环境监测与保护",
                            id: 944
                        },
                        {
                            name: "资源环境与城市管理",
                            id: 945
                        },

                    ]
                },
                {
                    name: "气象类",
                    content: [
                        {
                            name: "大气科学技术",
                            id: 950
                        },
                        {
                            name: "大气探测技术",
                            id: 949
                        },
                        {
                            name: "防雷技术",
                            id: 953
                        },
                        {
                            name: "应用气象技术",
                            id: 984
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 3,
            name: "交通运输类",
            content: [
                {
                    name: "城市轨道运输类",
                    content: [
                        {
                            name: "城市轨道交通车辆",
                            id: 590
                        },
                        {
                            name: "城市轨道交通工程技术",
                            id: 587
                        },
                        {
                            name: "城市轨道交通控制",
                            id: 591
                        },
                        {
                            name: "城市轨道交通运营管理",
                            id: 592
                        },

                    ]
                },
                {
                    name: "港口运输类",
                    content: [
                        {
                            name: "报关与国际货运",
                            id: 630
                        },
                        {
                            name: "港口工程技术",
                            id: 629
                        },
                        {
                            name: "港口机械应用技术",
                            id: 633
                        },
                        {
                            name: "港口物流管理",
                            id: 632
                        },
                        {
                            name: "港口物流设备与自动控制",
                            id: 622
                        },
                        {
                            name: "港口业务管理",
                            id: 625
                        },
                        {
                            name: "港口与航运管理",
                            id: 631
                        },
                        {
                            name: "集装箱运输管理",
                            id: 626
                        },

                    ]
                },
                {
                    name: "公路运输类",
                    content: [
                        {
                            name: "城市交通运输",
                            id: 569
                        },
                        {
                            name: "道路桥梁工程技术",
                            id: 567
                        },
                        {
                            name: "高等级公路维护与管理",
                            id: 561
                        },
                        {
                            name: "工程机械技术服务与营销",
                            id: 576
                        },
                        {
                            name: "工程机械控制技术",
                            id: 581
                        },
                        {
                            name: "工程机械运用与维护",
                            id: 572
                        },
                        {
                            name: "公路工程管理",
                            id: 571
                        },
                        {
                            name: "公路工程造价管理",
                            id: 574
                        },
                        {
                            name: "公路机械化施工技术",
                            id: 597
                        },
                        {
                            name: "公路监理",
                            id: 573
                        },
                        {
                            name: "公路运输与管理",
                            id: 568
                        },
                        {
                            name: "交通安全与智能控制",
                            id: 566
                        },
                        {
                            name: "路政管理",
                            id: 562
                        },
                        {
                            name: "汽车运用技术",
                            id: 564
                        },

                    ]
                },
                {
                    name: "管道运输类",
                    content: [
                        {
                            name: "管道工程技术",
                            id: 639
                        },
                        {
                            name: "管道工程施工",
                            id: 635
                        },
                        {
                            name: "管道运输管理",
                            id: 634
                        },

                    ]
                },
                {
                    name: "民航运输类",
                    content: [
                        {
                            name: "飞行技术",
                            id: 286
                        },
                        {
                            name: "飞机机电设备维修",
                            id: 619
                        },
                        {
                            name: "飞机结构修理",
                            id: 620
                        },
                        {
                            name: "飞机控制设备与仪表",
                            id: 628
                        },
                        {
                            name: "飞机维修",
                            id: 617
                        },
                        {
                            name: "飞机制造技术",
                            id: 610
                        },
                        {
                            name: "航空电子电气技术",
                            id: 616
                        },
                        {
                            name: "航空电子设备维修",
                            id: 604
                        },
                        {
                            name: "航空发动机装配与试车",
                            id: 618
                        },
                        {
                            name: "航空服务",
                            id: 609
                        },
                        {
                            name: "航空港安全检查",
                            id: 627
                        },
                        {
                            name: "航空港管理",
                            id: 613
                        },
                        {
                            name: "航空机电设备维修",
                            id: 607
                        },
                        {
                            name: "航空通信技术",
                            id: 608
                        },
                        {
                            name: "航空物流",
                            id: 624
                        },
                        {
                            name: "航空油料管理和应用",
                            id: 614
                        },
                        {
                            name: "空中乘务",
                            id: 611
                        },
                        {
                            name: "空中交通管理",
                            id: 615
                        },
                        {
                            name: "民航安全技术管理",
                            id: 612
                        },
                        {
                            name: "民航空中安全保卫",
                            id: 621
                        },
                        {
                            name: "民航商务",
                            id: 623
                        },
                        {
                            name: "民航特种车辆维修",
                            id: 605
                        },
                        {
                            name: "民航运输",
                            id: 603
                        },

                    ]
                },
                {
                    name: "水上运输类",
                    content: [
                        {
                            name: "船舶工程技术",
                            id: 602
                        },
                        {
                            name: "船舶检验",
                            id: 599
                        },
                        {
                            name: "船舶舾装",
                            id: 600
                        },
                        {
                            name: "船机制造与维修",
                            id: 598
                        },
                        {
                            name: "国际航运业务管理",
                            id: 593
                        },
                        {
                            name: "海事管理",
                            id: 458
                        },
                        {
                            name: "航道工程技术",
                            id: 595
                        },
                        {
                            name: "航海技术",
                            id: 293
                        },
                        {
                            name: "轮机工程技术",
                            id: 596
                        },
                        {
                            name: "水运管理",
                            id: 589
                        },

                    ]
                },
                {
                    name: "铁道运输类",
                    content: [
                        {
                            name: "电气化铁道技术",
                            id: 575
                        },
                        {
                            name: "高速动车组驾驶",
                            id: 601
                        },
                        {
                            name: "高速动车组检修技术",
                            id: 585
                        },
                        {
                            name: "高速铁道技术",
                            id: 577
                        },
                        {
                            name: "高速铁路工程及维护技术",
                            id: 583
                        },
                        {
                            name: "铁道车辆",
                            id: 578
                        },
                        {
                            name: "铁道工程技术",
                            id: 582
                        },
                        {
                            name: "铁道机车车辆",
                            id: 579
                        },
                        {
                            name: "铁道交通运营管理",
                            id: 584
                        },
                        {
                            name: "铁道通信信号",
                            id: 586
                        },
                        {
                            name: "铁道运输经济",
                            id: 580
                        },

                    ]
                },

            ]
        },
        {
            type: 0,
            width: 2,
            name: "教育学",
            content: [
                {
                    name: "教育学类",
                    content: [
                        {
                            name: "华文教育",
                            id: 62
                        },
                        {
                            name: "教育技术学",
                            id: 60
                        },
                        {
                            name: "教育学",
                            id: 51
                        },
                        {
                            name: "科学教育",
                            id: 54
                        },
                        {
                            name: "人文教育",
                            id: 53
                        },
                        {
                            name: "特殊教育",
                            id: 93
                        },
                        {
                            name: "小学教育",
                            id: 56
                        },
                        {
                            name: "学前教育",
                            id: 58
                        },
                        {
                            name: "艺术教育",
                            id: 59
                        },

                    ]
                },
                {
                    name: "体育学类",
                    content: [
                        {
                            name: "社会体育指导与管理",
                            id: 61
                        },
                        {
                            name: "体育教育",
                            id: 57
                        },
                        {
                            name: "武术与民族传统体育",
                            id: 63
                        },
                        {
                            name: "休闲体育",
                            id: 79
                        },
                        {
                            name: "运动康复",
                            id: 66
                        },
                        {
                            name: "运动人体科学",
                            id: 65
                        },
                        {
                            name: "运动训练",
                            id: 64
                        },

                    ]
                },

            ]
        },
        {
            type: 0,
            width: 2,
            name: "经济学",
            content: [
                {
                    name: "财政学类",
                    content: [
                        {
                            name: "财政学",
                            id: 8
                        },
                        {
                            name: "税收学",
                            id: 14
                        },

                    ]
                },
                {
                    name: "金融学类",
                    content: [
                        {
                            name: "保险学",
                            id: 12
                        },
                        {
                            name: "金融工程",
                            id: 10
                        },
                        {
                            name: "金融数学",
                            id: 21
                        },
                        {
                            name: "金融学",
                            id: 9
                        },
                        {
                            name: "经济与金融",
                            id: 15
                        },
                        {
                            name: "投资学",
                            id: 29
                        },
                        {
                            name: "信用管理",
                            id: 32
                        },

                    ]
                },
                {
                    name: "经济学类",
                    content: [
                        {
                            name: "国民经济管理",
                            id: 5
                        },
                        {
                            name: "经济统计学",
                            id: 6
                        },
                        {
                            name: "经济学",
                            id: 4
                        },
                        {
                            name: "能源经济",
                            id: 13
                        },
                        {
                            name: "商务经济学",
                            id: 7
                        },
                        {
                            name: "资源与环境经济学",
                            id: 11
                        },

                    ]
                },
                {
                    name: "经济与贸易类",
                    content: [
                        {
                            name: "国际经济与贸易",
                            id: 16
                        },
                        {
                            name: "贸易经济",
                            id: 17
                        },

                    ]
                },

            ]
        },
        {
            type: 0,
            width: 1,
            name: "理学",
            content: [
                {
                    name: "大气科学类",
                    content: [
                        {
                            name: "大气科学",
                            id: 166
                        },
                        {
                            name: "应用气象学",
                            id: 179
                        },

                    ]
                },
                {
                    name: "地理科学类",
                    content: [
                        {
                            name: "地理科学",
                            id: 167
                        },
                        {
                            name: "地理信息科学",
                            id: 170
                        },
                        {
                            name: "人文地理与城乡规划",
                            id: 163
                        },
                        {
                            name: "自然地理与资源环境",
                            id: 164
                        },

                    ]
                },
                {
                    name: "地球物理学类",
                    content: [
                        {
                            name: "地球物理学",
                            id: 174
                        },
                        {
                            name: "空间科学与技术",
                            id: 171
                        },

                    ]
                },
                {
                    name: "地质学类",
                    content: [
                        {
                            name: "地球化学",
                            id: 172
                        },
                        {
                            name: "地球信息科学与技术",
                            id: 173
                        },
                        {
                            name: "地质学",
                            id: 175
                        },
                        {
                            name: "古生物学",
                            id: 178
                        },

                    ]
                },
                {
                    name: "海洋科学类",
                    content: [
                        {
                            name: "海洋技术",
                            id: 165
                        },
                        {
                            name: "海洋科学",
                            id: 169
                        },
                        {
                            name: "海洋资源与环境",
                            id: 168
                        },
                        {
                            name: "军事海洋学",
                            id: 176
                        },

                    ]
                },
                {
                    name: "化学类",
                    content: [
                        {
                            name: "分子科学与工程",
                            id: 156
                        },
                        {
                            name: "化学",
                            id: 155
                        },
                        {
                            name: "化学生物学",
                            id: 159
                        },
                        {
                            name: "应用化学",
                            id: 157
                        },

                    ]
                },
                {
                    name: "生物科学类",
                    content: [
                        {
                            name: "生态学",
                            id: 183
                        },
                        {
                            name: "生物技术",
                            id: 177
                        },
                        {
                            name: "生物科学",
                            id: 182
                        },
                        {
                            name: "生物信息学",
                            id: 184
                        },

                    ]
                },
                {
                    name: "数学类",
                    content: [
                        {
                            name: "数理基础科学",
                            id: 158
                        },
                        {
                            name: "数学与应用数学",
                            id: 162
                        },
                        {
                            name: "信息与计算科学",
                            id: 153
                        },

                    ]
                },
                {
                    name: "天文学类",
                    content: [
                        {
                            name: "天文学",
                            id: 160
                        },

                    ]
                },
                {
                    name: "统计学类",
                    content: [
                        {
                            name: "统计学",
                            id: 181
                        },
                        {
                            name: "应用统计学",
                            id: 188
                        },

                    ]
                },
                {
                    name: "物理学类",
                    content: [
                        {
                            name: "核物理",
                            id: 154
                        },
                        {
                            name: "声学",
                            id: 161
                        },
                        {
                            name: "物理学",
                            id: 149
                        },
                        {
                            name: "应用物理学",
                            id: 151
                        },

                    ]
                },
                {
                    name: "心理学类",
                    content: [
                        {
                            name: "心理学",
                            id: 180
                        },
                        {
                            name: "应用心理学",
                            id: 185
                        },

                    ]
                },

            ]
        },
        {
            type: 0,
            width: 2,
            name: "历史学",
            content: [
                {
                    name: "历史学类",
                    content: [
                        {
                            name: "考古学",
                            id: 142
                        },
                        {
                            name: "历史学",
                            id: 141
                        },
                        {
                            name: "世界史",
                            id: 143
                        },
                        {
                            name: "外国语言与外国历史",
                            id: 152
                        },
                        {
                            name: "文物保护技术",
                            id: 150
                        },
                        {
                            name: "文物与博物馆学",
                            id: 148
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 2,
            name: "旅游类",
            content: [
                {
                    name: "餐饮管理与服务类",
                    content: [
                        {
                            name: "餐饮管理与服务",
                            id: 1100
                        },
                        {
                            name: "烹饪工艺与营养",
                            id: 1101
                        },
                        {
                            name: "西餐工艺",
                            id: 1109
                        },

                    ]
                },
                {
                    name: "旅游管理类",
                    content: [
                        {
                            name: "导游",
                            id: 1095
                        },
                        {
                            name: "会展策划与管理",
                            id: 1104
                        },
                        {
                            name: "景区开发与管理",
                            id: 1096
                        },
                        {
                            name: "酒店管理",
                            id: 479
                        },
                        {
                            name: "历史文化旅游",
                            id: 1097
                        },
                        {
                            name: "旅行社经营管理",
                            id: 1094
                        },
                        {
                            name: "旅游服务与管理",
                            id: 1103
                        },
                        {
                            name: "旅游管理",
                            id: 467
                        },
                        {
                            name: "涉外旅游",
                            id: 1092
                        },
                        {
                            name: "休闲服务与管理",
                            id: 1099
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 3,
            name: "农林牧渔类",
            content: [
                {
                    name: "畜牧兽医类",
                    content: [
                        {
                            name: "蚕桑技术",
                            id: 545
                        },
                        {
                            name: "宠物养护与疫病防治",
                            id: 544
                        },
                        {
                            name: "畜牧",
                            id: 535
                        },
                        {
                            name: "畜牧兽医",
                            id: 543
                        },
                        {
                            name: "动物防疫与检疫",
                            id: 539
                        },
                        {
                            name: "动物科学与技术",
                            id: 548
                        },
                        {
                            name: "动物医学",
                            id: 375
                        },
                        {
                            name: "实验动物养殖",
                            id: 541
                        },
                        {
                            name: "兽药生产与营销",
                            id: 546
                        },
                        {
                            name: "兽医",
                            id: 547
                        },
                        {
                            name: "兽医医药",
                            id: 538
                        },
                        {
                            name: "饲料与动物营养",
                            id: 537
                        },
                        {
                            name: "特种动物养殖",
                            id: 534
                        },

                    ]
                },
                {
                    name: "林业技术类",
                    content: [
                        {
                            name: "城市园林",
                            id: 540
                        },
                        {
                            name: "林产化工技术",
                            id: 524
                        },
                        {
                            name: "林副新产品加工",
                            id: 532
                        },
                        {
                            name: "林业技术",
                            id: 521
                        },
                        {
                            name: "木材加工技术",
                            id: 531
                        },
                        {
                            name: "森林采运工程",
                            id: 533
                        },
                        {
                            name: "森林工程技术",
                            id: 536
                        },
                        {
                            name: "森林生态旅游",
                            id: 527
                        },
                        {
                            name: "森林资源保护",
                            id: 525
                        },
                        {
                            name: "商品花卉",
                            id: 530
                        },
                        {
                            name: "野生动物保护",
                            id: 528
                        },
                        {
                            name: "野生植物资源开发与利用",
                            id: 526
                        },
                        {
                            name: "园林技术",
                            id: 523
                        },
                        {
                            name: "自然保护区建设与管理",
                            id: 529
                        },

                    ]
                },
                {
                    name: "农林管理类",
                    content: [
                        {
                            name: "都市林业资源与林政管理",
                            id: 557
                        },
                        {
                            name: "林业经济信息管理",
                            id: 554
                        },
                        {
                            name: "林业信息工程与管理",
                            id: 559
                        },
                        {
                            name: "农村行政管理",
                            id: 552
                        },
                        {
                            name: "农村行政与经济管理",
                            id: 563
                        },
                        {
                            name: "农业技术与管理",
                            id: 558
                        },
                        {
                            name: "农业经济管理",
                            id: 550
                        },
                        {
                            name: "乡镇企业管理",
                            id: 560
                        },
                        {
                            name: "渔业资源与渔政管理",
                            id: 556
                        },

                    ]
                },
                {
                    name: "农业技术类",
                    content: [
                        {
                            name: "茶叶生产加工技术",
                            id: 506
                        },
                        {
                            name: "茶艺",
                            id: 515
                        },
                        {
                            name: "观光农业",
                            id: 507
                        },
                        {
                            name: "绿色食品生产与检测",
                            id: 520
                        },
                        {
                            name: "绿色食品生产与经营",
                            id: 518
                        },
                        {
                            name: "农产品质量检测",
                            id: 514
                        },
                        {
                            name: "设施农业技术",
                            id: 505
                        },
                        {
                            name: "食药用菌",
                            id: 522
                        },
                        {
                            name: "烟草栽培技术",
                            id: 509
                        },
                        {
                            name: "药用植物栽培加工",
                            id: 519
                        },
                        {
                            name: "园艺技术",
                            id: 513
                        },
                        {
                            name: "植物保护",
                            id: 371
                        },
                        {
                            name: "植物检疫",
                            id: 512
                        },
                        {
                            name: "中草药栽培技术",
                            id: 516
                        },
                        {
                            name: "种子生产与经营",
                            id: 510
                        },
                        {
                            name: "作物生产技术",
                            id: 517
                        },

                    ]
                },
                {
                    name: "水产养殖类",
                    content: [
                        {
                            name: "城市渔业",
                            id: 555
                        },
                        {
                            name: "海洋捕捞技术",
                            id: 549
                        },
                        {
                            name: "水产养殖技术",
                            id: 553
                        },
                        {
                            name: "水生动植物保护",
                            id: 551
                        },
                        {
                            name: "水族科学与技术",
                            id: 381
                        },
                        {
                            name: "渔业综合技术",
                            id: 565
                        },

                    ]
                },

            ]
        },
        {
            type: 0,
            width: 1,
            name: "农学",
            content: [
                {
                    name: "草学类",
                    content: [
                        {
                            name: "草业科学",
                            id: 414
                        },

                    ]
                },
                {
                    name: "动物生产类",
                    content: [
                        {
                            name: "蚕学",
                            id: 367
                        },
                        {
                            name: "动物科学",
                            id: 365
                        },
                        {
                            name: "蜂学",
                            id: 368
                        },

                    ]
                },
                {
                    name: "动物医学类",
                    content: [
                        {
                            name: "动物药学",
                            id: 378
                        },
                        {
                            name: "动物医学",
                            id: 375
                        },
                        {
                            name: "动植物检疫",
                            id: 373
                        },

                    ]
                },
                {
                    name: "林学类",
                    content: [
                        {
                            name: "林学",
                            id: 379
                        },
                        {
                            name: "森林保护",
                            id: 377
                        },
                        {
                            name: "园林",
                            id: 374
                        },

                    ]
                },
                {
                    name: "水产类",
                    content: [
                        {
                            name: "海洋渔业科学与技术",
                            id: 380
                        },
                        {
                            name: "水产养殖学",
                            id: 376
                        },
                        {
                            name: "水族科学与技术",
                            id: 381
                        },

                    ]
                },
                {
                    name: "植物生产类",
                    content: [
                        {
                            name: "茶学",
                            id: 364
                        },
                        {
                            name: "农学",
                            id: 358
                        },
                        {
                            name: "农艺教育",
                            id: 366
                        },
                        {
                            name: "设施农业科学与工程",
                            id: 360
                        },
                        {
                            name: "烟草",
                            id: 361
                        },
                        {
                            name: "应用生物科学",
                            id: 362
                        },
                        {
                            name: "园艺",
                            id: 355
                        },
                        {
                            name: "园艺教育",
                            id: 370
                        },
                        {
                            name: "植物保护",
                            id: 371
                        },
                        {
                            name: "植物科学与技术",
                            id: 357
                        },
                        {
                            name: "种子科学与工程",
                            id: 359
                        },

                    ]
                },
                {
                    name: "自然保护与环境生态类",
                    content: [
                        {
                            name: "农业资源与环境",
                            id: 372
                        },
                        {
                            name: "水土保持与荒漠化防治",
                            id: 369
                        },
                        {
                            name: "野生动物与自然保护区管理",
                            id: 363
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 3,
            name: "轻纺食品类",
            content: [
                {
                    name: "包装印刷类",
                    content: [
                        {
                            name: "版面编辑与校对",
                            id: 1008
                        },
                        {
                            name: "包装技术与设计",
                            id: 997
                        },
                        {
                            name: "出版信息管理",
                            id: 1006
                        },
                        {
                            name: "出版与电脑编辑技术",
                            id: 1010
                        },
                        {
                            name: "出版与发行",
                            id: 1004
                        },
                        {
                            name: "电子出版技术",
                            id: 1005
                        },
                        {
                            name: "轻工产品包装装潢设计",
                            id: 1014
                        },
                        {
                            name: "丝网工艺",
                            id: 1007
                        },
                        {
                            name: "印刷技术",
                            id: 998
                        },
                        {
                            name: "印刷设备及工艺",
                            id: 1002
                        },
                        {
                            name: "印刷图文信息处理",
                            id: 1001
                        },

                    ]
                },
                {
                    name: "纺织服装类",
                    content: [
                        {
                            name: "纺织品检验与贸易",
                            id: 970
                        },
                        {
                            name: "纺织品设计",
                            id: 977
                        },
                        {
                            name: "纺织品装饰艺术设计",
                            id: 981
                        },
                        {
                            name: "服用材料设计与应用",
                            id: 976
                        },
                        {
                            name: "服装工艺技术",
                            id: 971
                        },
                        {
                            name: "服装设计",
                            id: 968
                        },
                        {
                            name: "服装设计与加工",
                            id: 972
                        },
                        {
                            name: "服装养护技术",
                            id: 975
                        },
                        {
                            name: "服装营销与管理",
                            id: 987
                        },
                        {
                            name: "服装制版与工艺",
                            id: 973
                        },
                        {
                            name: "染织艺术设计",
                            id: 969
                        },
                        {
                            name: "丝绸技术",
                            id: 965
                        },
                        {
                            name: "现代纺织技术",
                            id: 962
                        },
                        {
                            name: "鞋类设计与工艺",
                            id: 978
                        },
                        {
                            name: "新型纺织机电技术",
                            id: 974
                        },
                        {
                            name: "针织技术与针织服装",
                            id: 966
                        },

                    ]
                },
                {
                    name: "轻化工类",
                    content: [
                        {
                            name: "表面精饰工艺",
                            id: 963
                        },
                        {
                            name: "高分子材料加工技术",
                            id: 956
                        },
                        {
                            name: "皮革制品设计与工艺",
                            id: 964
                        },
                        {
                            name: "染整技术",
                            id: 967
                        },
                        {
                            name: "香料香精工艺",
                            id: 960
                        },
                        {
                            name: "制浆造纸技术",
                            id: 961
                        },

                    ]
                },
                {
                    name: "食品类",
                    content: [
                        {
                            name: "畜产品加工与检测",
                            id: 1003
                        },
                        {
                            name: "发酵技术",
                            id: 1009
                        },
                        {
                            name: "粮食工程",
                            id: 337
                        },
                        {
                            name: "粮油储藏与检测技术",
                            id: 990
                        },
                        {
                            name: "酿酒技术",
                            id: 999
                        },
                        {
                            name: "农畜特产品加工",
                            id: 985
                        },
                        {
                            name: "乳品工艺",
                            id: 992
                        },
                        {
                            name: "食品分析与检验",
                            id: 988
                        },
                        {
                            name: "食品工艺技术",
                            id: 994
                        },
                        {
                            name: "食品工艺与检测",
                            id: 1000
                        },
                        {
                            name: "食品机械与管理",
                            id: 983
                        },
                        {
                            name: "食品加工及管理",
                            id: 991
                        },
                        {
                            name: "食品加工技术",
                            id: 980
                        },
                        {
                            name: "食品检测及管理",
                            id: 996
                        },
                        {
                            name: "食品生物技术",
                            id: 986
                        },
                        {
                            name: "食品卫生检验",
                            id: 995
                        },
                        {
                            name: "食品营养与检测",
                            id: 979
                        },
                        {
                            name: "食品贮运与营销",
                            id: 982
                        },
                        {
                            name: "营养与食品卫生",
                            id: 993
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 3,
            name: "生化,药品类",
            content: [
                {
                    name: "化工技术类",
                    content: [
                        {
                            name: "高聚物生产技术",
                            id: 644
                        },
                        {
                            name: "工业分析与检验",
                            id: 654
                        },
                        {
                            name: "花炮生产与管理方向",
                            id: 648
                        },
                        {
                            name: "化工设备维修技术",
                            id: 653
                        },
                        {
                            name: "化工设备与机械",
                            id: 651
                        },
                        {
                            name: "化纤生产技术",
                            id: 646
                        },
                        {
                            name: "火工工艺技术",
                            id: 650
                        },
                        {
                            name: "精细化学品生产技术",
                            id: 645
                        },
                        {
                            name: "炼油技术",
                            id: 659
                        },
                        {
                            name: "石油化工生产技术",
                            id: 649
                        },
                        {
                            name: "涂装防护工艺",
                            id: 647
                        },
                        {
                            name: "烟花爆竹安全与质量技术",
                            id: 652
                        },
                        {
                            name: "应用化工技术",
                            id: 643
                        },
                        {
                            name: "有机化工生产技术",
                            id: 642
                        },

                    ]
                },
                {
                    name: "生物技术类",
                    content: [
                        {
                            name: "生物化工工艺",
                            id: 637
                        },
                        {
                            name: "生物技术及应用",
                            id: 640
                        },
                        {
                            name: "生物实验技术",
                            id: 638
                        },
                        {
                            name: "微生物技术及应用",
                            id: 636
                        },

                    ]
                },
                {
                    name: "食品药品管理类",
                    content: [
                        {
                            name: "保健品开发与管理",
                            id: 668
                        },
                        {
                            name: "技术监督与商检",
                            id: 661
                        },
                        {
                            name: "食品药品监督管理",
                            id: 663
                        },
                        {
                            name: "药品经营与管理",
                            id: 665
                        },
                        {
                            name: "药品质量检测技术",
                            id: 660
                        },

                    ]
                },
                {
                    name: "制药技术类",
                    content: [
                        {
                            name: "化学制药技术",
                            id: 655
                        },
                        {
                            name: "生化制药技术",
                            id: 658
                        },
                        {
                            name: "生物制药技术",
                            id: 656
                        },
                        {
                            name: "药物分析技术",
                            id: 657
                        },
                        {
                            name: "药物制剂技术",
                            id: 664
                        },
                        {
                            name: "中药制药技术",
                            id: 666
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 2,
            name: "水利类",
            content: [
                {
                    name: "水利工程与管理类",
                    content: [
                        {
                            name: "城市水利",
                            id: 804
                        },
                        {
                            name: "港口航道与治河工程",
                            id: 799
                        },
                        {
                            name: "灌溉与排水技术",
                            id: 800
                        },
                        {
                            name: "河务工程与管理",
                            id: 803
                        },
                        {
                            name: "农业水利技术",
                            id: 815
                        },
                        {
                            name: "水利工程",
                            id: 801
                        },
                        {
                            name: "水利工程监理",
                            id: 807
                        },
                        {
                            name: "水利工程施工技术",
                            id: 802
                        },
                        {
                            name: "水利工程实验与检测技术",
                            id: 806
                        },
                        {
                            name: "水利工程造价管理",
                            id: 811
                        },
                        {
                            name: "水利水电工程管理",
                            id: 808
                        },
                        {
                            name: "水利水电建筑工程",
                            id: 798
                        },
                        {
                            name: "水务管理",
                            id: 812
                        },

                    ]
                },
                {
                    name: "水利水电设备类",
                    content: [
                        {
                            name: "机电排灌设备与管理",
                            id: 810
                        },
                        {
                            name: "机电设备运行与维护",
                            id: 819
                        },
                        {
                            name: "水电站动力设备与管理",
                            id: 809
                        },
                        {
                            name: "水电站设备与管理",
                            id: 817
                        },

                    ]
                },
                {
                    name: "水土保持与水环境类",
                    content: [
                        {
                            name: "水环境监测与分析",
                            id: 813
                        },
                        {
                            name: "水土保持",
                            id: 818
                        },

                    ]
                },
                {
                    name: "水文与水资源类",
                    content: [
                        {
                            name: "水文与水资源",
                            id: 791
                        },
                        {
                            name: "水文自动化测报技术",
                            id: 794
                        },
                        {
                            name: "水信息技术",
                            id: 797
                        },
                        {
                            name: "水政水资源管理",
                            id: 805
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 2,
            name: "土建类",
            content: [
                {
                    name: "城镇规划与管理类",
                    content: [
                        {
                            name: "城市管理与监察",
                            id: 765
                        },
                        {
                            name: "城镇规划",
                            id: 764
                        },
                        {
                            name: "城镇建设",
                            id: 766
                        },

                    ]
                },
                {
                    name: "房地产类",
                    content: [
                        {
                            name: "房地产经营与估价",
                            id: 789
                        },
                        {
                            name: "物业管理",
                            id: 446
                        },
                        {
                            name: "物业设施管理",
                            id: 793
                        },

                    ]
                },
                {
                    name: "工程管理类",
                    content: [
                        {
                            name: "电力工程管理",
                            id: 778
                        },
                        {
                            name: "工程监理",
                            id: 787
                        },
                        {
                            name: "工程造价",
                            id: 432
                        },
                        {
                            name: "工程质量监督与管理",
                            id: 779
                        },
                        {
                            name: "建筑工程管理",
                            id: 774
                        },
                        {
                            name: "建筑工程项目管理",
                            id: 780
                        },
                        {
                            name: "建筑经济管理",
                            id: 783
                        },

                    ]
                },
                {
                    name: "建筑设备类",
                    content: [
                        {
                            name: "工业设备安装工程技术",
                            id: 773
                        },
                        {
                            name: "供热通风与空调工程技术",
                            id: 771
                        },
                        {
                            name: "供热通风与卫生工程技术",
                            id: 775
                        },
                        {
                            name: "机电安装工程",
                            id: 776
                        },
                        {
                            name: "建筑电气工程技术",
                            id: 772
                        },
                        {
                            name: "建筑设备工程技术",
                            id: 768
                        },
                        {
                            name: "楼宇智能化工程技术",
                            id: 785
                        },

                    ]
                },
                {
                    name: "建筑设计类",
                    content: [
                        {
                            name: "环境艺术设计",
                            id: 762
                        },
                        {
                            name: "建筑设计技术",
                            id: 796
                        },
                        {
                            name: "建筑装饰工程技术",
                            id: 763
                        },
                        {
                            name: "室内设计技术",
                            id: 757
                        },
                        {
                            name: "园林工程技术",
                            id: 761
                        },
                        {
                            name: "中国古建筑工程技术",
                            id: 759
                        },

                    ]
                },
                {
                    name: "市政工程类",
                    content: [
                        {
                            name: "城市燃气工程技术",
                            id: 782
                        },
                        {
                            name: "给排水工程技术",
                            id: 786
                        },
                        {
                            name: "建筑水电技术",
                            id: 795
                        },
                        {
                            name: "市政工程技术",
                            id: 784
                        },
                        {
                            name: "水工业技术",
                            id: 788
                        },
                        {
                            name: "消防工程技术",
                            id: 790
                        },

                    ]
                },
                {
                    name: "土建施工类",
                    content: [
                        {
                            name: "地下工程与隧道工程技术",
                            id: 781
                        },
                        {
                            name: "基础工程技术",
                            id: 770
                        },
                        {
                            name: "建筑工程技术",
                            id: 769
                        },
                        {
                            name: "土木工程检测技术",
                            id: 767
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 3,
            name: "文化教育类",
            content: [
                {
                    name: "教育类",
                    content: [
                        {
                            name: "茶文化",
                            id: 1161
                        },
                        {
                            name: "初等教育",
                            id: 1172
                        },
                        {
                            name: "地理教育",
                            id: 1183
                        },
                        {
                            name: "俄语教育",
                            id: 1192
                        },
                        {
                            name: "儿童康复",
                            id: 1176
                        },
                        {
                            name: "化学教育",
                            id: 1163
                        },
                        {
                            name: "计算机教育",
                            id: 1178
                        },
                        {
                            name: "教育管理",
                            id: 1189
                        },
                        {
                            name: "科学教育",
                            id: 54
                        },
                        {
                            name: "历史教育",
                            id: 1165
                        },
                        {
                            name: "美术教育",
                            id: 1167
                        },
                        {
                            name: "民族传统体育",
                            id: 1186
                        },
                        {
                            name: "人群康复",
                            id: 1179
                        },
                        {
                            name: "生物教育",
                            id: 1168
                        },
                        {
                            name: "实验管理与教学",
                            id: 1195
                        },
                        {
                            name: "书法教育",
                            id: 1158
                        },
                        {
                            name: "数学教育",
                            id: 1171
                        },
                        {
                            name: "思想政治教育",
                            id: 50
                        },
                        {
                            name: "特殊教育",
                            id: 93
                        },
                        {
                            name: "体育教育",
                            id: 57
                        },
                        {
                            name: "武术",
                            id: 1198
                        },
                        {
                            name: "舞蹈教育",
                            id: 1190
                        },
                        {
                            name: "物理教育",
                            id: 1160
                        },
                        {
                            name: "现代教育技术",
                            id: 1175
                        },
                        {
                            name: "心理咨询与心理健康教育",
                            id: 1187
                        },
                        {
                            name: "学前教育",
                            id: 58
                        },
                        {
                            name: "艺术教育",
                            id: 59
                        },
                        {
                            name: "音乐教育",
                            id: 1177
                        },
                        {
                            name: "英语教育",
                            id: 1166
                        },
                        {
                            name: "应用心理学",
                            id: 185
                        },
                        {
                            name: "语文教育",
                            id: 1162
                        },
                        {
                            name: "中国少数民族语言文化",
                            id: 1156
                        },
                        {
                            name: "综合理科教育",
                            id: 1185
                        },
                        {
                            name: "综合文科教育",
                            id: 1181
                        },

                    ]
                },
                {
                    name: "体育类",
                    content: [
                        {
                            name: "竞技体育",
                            id: 1191
                        },
                        {
                            name: "社会体育",
                            id: 1197
                        },
                        {
                            name: "体育保健",
                            id: 1200
                        },
                        {
                            name: "体育服务与管理",
                            id: 1201
                        },
                        {
                            name: "武术",
                            id: 1198
                        },
                        {
                            name: "运动训练",
                            id: 64
                        },

                    ]
                },
                {
                    name: "语言文化类",
                    content: [
                        {
                            name: "茶文化",
                            id: 1161
                        },
                        {
                            name: "汉语",
                            id: 1135
                        },
                        {
                            name: "旅游日语",
                            id: 1154
                        },
                        {
                            name: "旅游英语",
                            id: 1143
                        },
                        {
                            name: "商务日语",
                            id: 1145
                        },
                        {
                            name: "商务英语",
                            id: 139
                        },
                        {
                            name: "书法教育",
                            id: 1158
                        },
                        {
                            name: "图书档案管理",
                            id: 1153
                        },
                        {
                            name: "文化市场经营与管理",
                            id: 1149
                        },
                        {
                            name: "文化事业管理",
                            id: 1148
                        },
                        {
                            name: "文秘",
                            id: 1146
                        },
                        {
                            name: "文物鉴定与修复",
                            id: 1142
                        },
                        {
                            name: "应用阿拉伯语",
                            id: 1147
                        },
                        {
                            name: "应用德语",
                            id: 1140
                        },
                        {
                            name: "应用俄语",
                            id: 1136
                        },
                        {
                            name: "应用法语",
                            id: 1144
                        },
                        {
                            name: "应用韩语",
                            id: 1138
                        },
                        {
                            name: "应用柬埔寨语",
                            id: 1157
                        },
                        {
                            name: "应用老挝语",
                            id: 1164
                        },
                        {
                            name: "应用缅甸语",
                            id: 1159
                        },
                        {
                            name: "应用日语",
                            id: 1134
                        },
                        {
                            name: "应用泰国语",
                            id: 1155
                        },
                        {
                            name: "应用西班牙语",
                            id: 1151
                        },
                        {
                            name: "应用意大利语",
                            id: 1152
                        },
                        {
                            name: "应用英语",
                            id: 1139
                        },
                        {
                            name: "应用越南语",
                            id: 1150
                        },
                        {
                            name: "中国少数民族语言文化",
                            id: 1156
                        },

                    ]
                },

            ]
        },
        {
            type: 0,
            width: 1,
            name: "文学",
            content: [
                {
                    name: "外国语言文学类",
                    content: [
                        {
                            name: "阿尔巴尼亚语",
                            id: 102
                        },
                        {
                            name: "阿拉伯语",
                            id: 85
                        },
                        {
                            name: "爱尔兰语",
                            id: 127
                        },
                        {
                            name: "爱沙尼亚语",
                            id: 134
                        },
                        {
                            name: "保加利亚语",
                            id: 99
                        },
                        {
                            name: "冰岛语",
                            id: 125
                        },
                        {
                            name: "波兰语",
                            id: 101
                        },
                        {
                            name: "波斯语",
                            id: 86
                        },
                        {
                            name: "朝鲜语",
                            id: 88
                        },
                        {
                            name: "丹麦语",
                            id: 123
                        },
                        {
                            name: "德语",
                            id: 75
                        },
                        {
                            name: "俄语",
                            id: 76
                        },
                        {
                            name: "法语",
                            id: 77
                        },
                        {
                            name: "翻译",
                            id: 133
                        },
                        {
                            name: "梵语巴利语",
                            id: 81
                        },
                        {
                            name: "菲律宾语",
                            id: 83
                        },
                        {
                            name: "芬兰语",
                            id: 119
                        },
                        {
                            name: "哈萨克语",
                            id: 135
                        },
                        {
                            name: "豪萨语",
                            id: 98
                        },
                        {
                            name: "荷兰语",
                            id: 118
                        },
                        {
                            name: "柬埔寨语",
                            id: 84
                        },
                        {
                            name: "捷克语",
                            id: 100
                        },
                        {
                            name: "克罗地亚语",
                            id: 120
                        },
                        {
                            name: "拉丁语",
                            id: 137
                        },
                        {
                            name: "拉脱维亚语",
                            id: 124
                        },
                        {
                            name: "老挝语",
                            id: 96
                        },
                        {
                            name: "立陶宛语",
                            id: 126
                        },
                        {
                            name: "罗马尼亚语",
                            id: 103
                        },
                        {
                            name: "马耳他语",
                            id: 132
                        },
                        {
                            name: "马来语",
                            id: 87
                        },
                        {
                            name: "蒙古语",
                            id: 89
                        },
                        {
                            name: "孟加拉语",
                            id: 117
                        },
                        {
                            name: "缅甸语",
                            id: 91
                        },
                        {
                            name: "尼泊尔语",
                            id: 122
                        },
                        {
                            name: "挪威语",
                            id: 121
                        },
                        {
                            name: "葡萄牙语",
                            id: 115
                        },
                        {
                            name: "普什图语",
                            id: 113
                        },
                        {
                            name: "日语",
                            id: 78
                        },
                        {
                            name: "瑞典语",
                            id: 106
                        },
                        {
                            name: "塞尔维亚语",
                            id: 107
                        },
                        {
                            name: "僧伽罗语",
                            id: 90
                        },
                        {
                            name: "商务英语",
                            id: 139
                        },
                        {
                            name: "世界语",
                            id: 116
                        },
                        {
                            name: "斯洛伐克语",
                            id: 112
                        },
                        {
                            name: "斯洛文尼亚语",
                            id: 128
                        },
                        {
                            name: "斯瓦希里语",
                            id: 97
                        },
                        {
                            name: "泰米尔语",
                            id: 114
                        },
                        {
                            name: "泰语",
                            id: 92
                        },
                        {
                            name: "土耳其语",
                            id: 108
                        },
                        {
                            name: "乌尔都语",
                            id: 94
                        },
                        {
                            name: "乌克兰语",
                            id: 129
                        },
                        {
                            name: "乌兹别克语",
                            id: 130
                        },
                        {
                            name: "西班牙语",
                            id: 80
                        },
                        {
                            name: "希伯来语",
                            id: 95
                        },
                        {
                            name: "希腊语",
                            id: 110
                        },
                        {
                            name: "匈牙利语",
                            id: 109
                        },
                        {
                            name: "意大利语",
                            id: 111
                        },
                        {
                            name: "印地语",
                            id: 104
                        },
                        {
                            name: "印度尼西亚语",
                            id: 82
                        },
                        {
                            name: "英语",
                            id: 72
                        },
                        {
                            name: "越南语",
                            id: 105
                        },
                        {
                            name: "祖鲁语",
                            id: 131
                        },

                    ]
                },
                {
                    name: "新闻传播学类",
                    content: [
                        {
                            name: "编辑出版学",
                            id: 138
                        },
                        {
                            name: "传播学",
                            id: 147
                        },
                        {
                            name: "广播电视学",
                            id: 146
                        },
                        {
                            name: "广告学",
                            id: 140
                        },
                        {
                            name: "数字出版",
                            id: 144
                        },
                        {
                            name: "网络与新媒体",
                            id: 145
                        },
                        {
                            name: "新闻学",
                            id: 136
                        },

                    ]
                },
                {
                    name: "中国语言文学类",
                    content: [
                        {
                            name: "对外汉语",
                            id: 1319
                        },
                        {
                            name: "古典文献学",
                            id: 68
                        },
                        {
                            name: "汉语国际教育",
                            id: 70
                        },
                        {
                            name: "汉语言",
                            id: 67
                        },
                        {
                            name: "汉语言文学",
                            id: 69
                        },
                        {
                            name: "秘书学",
                            id: 74
                        },
                        {
                            name: "应用语言学",
                            id: 71
                        },
                        {
                            name: "中国少数民族语言文学",
                            id: 73
                        },

                    ]
                },

            ]
        },
        {
            type: 0,
            width: 1,
            name: "医学",
            content: [
                {
                    name: "法医学类",
                    content: [
                        {
                            name: "法医学",
                            id: 417
                        },

                    ]
                },
                {
                    name: "公共卫生与预防医学类",
                    content: [
                        {
                            name: "妇幼保健医学",
                            id: 389
                        },
                        {
                            name: "全球健康学",
                            id: 395
                        },
                        {
                            name: "食品卫生与营养学",
                            id: 387
                        },
                        {
                            name: "卫生监督",
                            id: 392
                        },
                        {
                            name: "预防医学",
                            id: 397
                        },

                    ]
                },
                {
                    name: "护理学类",
                    content: [
                        {
                            name: "护理学",
                            id: 422
                        },

                    ]
                },
                {
                    name: "基础医学类",
                    content: [
                        {
                            name: "基础医学",
                            id: 382
                        },

                    ]
                },
                {
                    name: "口腔医学类",
                    content: [
                        {
                            name: "口腔医学",
                            id: 390
                        },

                    ]
                },
                {
                    name: "临床医学类",
                    content: [
                        {
                            name: "放射医学",
                            id: 388
                        },
                        {
                            name: "精神医学",
                            id: 384
                        },
                        {
                            name: "临床医学",
                            id: 386
                        },
                        {
                            name: "麻醉学",
                            id: 383
                        },
                        {
                            name: "眼视光医学",
                            id: 391
                        },
                        {
                            name: "医学影像学",
                            id: 385
                        },

                    ]
                },
                {
                    name: "药学类",
                    content: [
                        {
                            name: "海洋药学",
                            id: 409
                        },
                        {
                            name: "临床药学",
                            id: 404
                        },
                        {
                            name: "药事管理",
                            id: 405
                        },
                        {
                            name: "药物分析",
                            id: 411
                        },
                        {
                            name: "药物化学",
                            id: 413
                        },
                        {
                            name: "药物制剂",
                            id: 402
                        },
                        {
                            name: "药学",
                            id: 401
                        },

                    ]
                },
                {
                    name: "医学技术类",
                    content: [
                        {
                            name: "康复治疗学",
                            id: 426
                        },
                        {
                            name: "口腔医学技术",
                            id: 421
                        },
                        {
                            name: "听力与言语康复学",
                            id: 424
                        },
                        {
                            name: "卫生检验与检疫",
                            id: 420
                        },
                        {
                            name: "眼视光学",
                            id: 419
                        },
                        {
                            name: "医学检验技术",
                            id: 418
                        },
                        {
                            name: "医学实验技术",
                            id: 423
                        },
                        {
                            name: "医学影像技术",
                            id: 439
                        },

                    ]
                },
                {
                    name: "中西医结合类",
                    content: [
                        {
                            name: "中西医临床医学",
                            id: 399
                        },

                    ]
                },
                {
                    name: "中药学类",
                    content: [
                        {
                            name: "藏药学",
                            id: 408
                        },
                        {
                            name: "蒙药学",
                            id: 415
                        },
                        {
                            name: "中草药栽培与鉴定",
                            id: 412
                        },
                        {
                            name: "中药学",
                            id: 407
                        },
                        {
                            name: "中药制药",
                            id: 416
                        },
                        {
                            name: "中药资源与开发",
                            id: 410
                        },

                    ]
                },
                {
                    name: "中医学类",
                    content: [
                        {
                            name: "藏医学",
                            id: 393
                        },
                        {
                            name: "哈医学",
                            id: 403
                        },
                        {
                            name: "蒙医学",
                            id: 406
                        },
                        {
                            name: "维医学",
                            id: 396
                        },
                        {
                            name: "针灸推拿学",
                            id: 394
                        },
                        {
                            name: "中医学",
                            id: 398
                        },
                        {
                            name: "壮医学",
                            id: 400
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 3,
            name: "医药卫生类",
            content: [
                {
                    name: "护理类",
                    content: [
                        {
                            name: "护理",
                            id: 1067
                        },
                        {
                            name: "助产",
                            id: 1068
                        },

                    ]
                },
                {
                    name: "临床医学类",
                    content: [
                        {
                            name: "藏医学",
                            id: 393
                        },
                        {
                            name: "口腔医学",
                            id: 390
                        },
                        {
                            name: "临床医学",
                            id: 386
                        },
                        {
                            name: "蒙医学",
                            id: 406
                        },
                        {
                            name: "维医学",
                            id: 396
                        },
                        {
                            name: "针灸推拿",
                            id: 1064
                        },
                        {
                            name: "中西医结合",
                            id: 1060
                        },
                        {
                            name: "中医骨伤",
                            id: 1062
                        },
                        {
                            name: "中医学",
                            id: 398
                        },

                    ]
                },
                {
                    name: "卫生管理类",
                    content: [
                        {
                            name: "公共卫生管理",
                            id: 1089
                        },
                        {
                            name: "卫生监督",
                            id: 392
                        },
                        {
                            name: "卫生信息管理",
                            id: 1091
                        },
                        {
                            name: "医学文秘",
                            id: 1098
                        },

                    ]
                },
                {
                    name: "药学类",
                    content: [
                        {
                            name: "维药学",
                            id: 1069
                        },
                        {
                            name: "现代中药技术",
                            id: 1077
                        },
                        {
                            name: "药学",
                            id: 401
                        },
                        {
                            name: "中药",
                            id: 1065
                        },
                        {
                            name: "中药鉴定与质量检测技术",
                            id: 1070
                        },

                    ]
                },
                {
                    name: "医学技术类",
                    content: [
                        {
                            name: "放射治疗技术",
                            id: 1088
                        },
                        {
                            name: "呼吸治疗技术",
                            id: 1080
                        },
                        {
                            name: "康复工程技术",
                            id: 1086
                        },
                        {
                            name: "康复治疗技术",
                            id: 1074
                        },
                        {
                            name: "口腔医学技术",
                            id: 421
                        },
                        {
                            name: "临床工程技术",
                            id: 1087
                        },
                        {
                            name: "实验动物技术",
                            id: 1084
                        },
                        {
                            name: "卫生检验与检疫技术",
                            id: 1085
                        },
                        {
                            name: "眼视光技术",
                            id: 1072
                        },
                        {
                            name: "医疗美容技术",
                            id: 1082
                        },
                        {
                            name: "医疗仪器维修技术",
                            id: 1079
                        },
                        {
                            name: "医学检验技术",
                            id: 418
                        },
                        {
                            name: "医学生物技术",
                            id: 1071
                        },
                        {
                            name: "医学实验技术",
                            id: 423
                        },
                        {
                            name: "医学营养",
                            id: 1075
                        },
                        {
                            name: "医学影像技术",
                            id: 439
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 4,
            name: "艺术设计传媒类",
            content: [
                {
                    name: "表演艺术类",
                    content: [
                        {
                            name: "编导",
                            id: 1234
                        },
                        {
                            name: "表演艺术",
                            id: 1229
                        },
                        {
                            name: "服装表演",
                            id: 1227
                        },
                        {
                            name: "钢琴伴奏",
                            id: 1237
                        },
                        {
                            name: "钢琴调律",
                            id: 1239
                        },
                        {
                            name: "乐器维护服务",
                            id: 1238
                        },
                        {
                            name: "乐器维修技术",
                            id: 1236
                        },
                        {
                            name: "模特与礼仪",
                            id: 1232
                        },
                        {
                            name: "舞蹈表演",
                            id: 473
                        },
                        {
                            name: "戏曲表演",
                            id: 1231
                        },
                        {
                            name: "音乐表演",
                            id: 470
                        },
                        {
                            name: "影视表演",
                            id: 1235
                        },
                        {
                            name: "杂技表演",
                            id: 1233
                        },

                    ]
                },
                {
                    name: "广播影视类",
                    content: [
                        {
                            name: "传媒策划与管理",
                            id: 1250
                        },
                        {
                            name: "电视节目制作",
                            id: 1247
                        },
                        {
                            name: "电视摄像",
                            id: 1255
                        },
                        {
                            name: "电视制片管理",
                            id: 1246
                        },
                        {
                            name: "广播电视技术",
                            id: 1240
                        },
                        {
                            name: "剪辑",
                            id: 1256
                        },
                        {
                            name: "录音技术与艺术",
                            id: 1257
                        },
                        {
                            name: "摄影",
                            id: 497
                        },
                        {
                            name: "摄影摄像技术",
                            id: 1242
                        },
                        {
                            name: "数字传媒艺术",
                            id: 1254
                        },
                        {
                            name: "新闻采编与制作",
                            id: 1248
                        },
                        {
                            name: "新闻与传播",
                            id: 1251
                        },
                        {
                            name: "信息传播与策划",
                            id: 1249
                        },
                        {
                            name: "音像技术",
                            id: 1241
                        },
                        {
                            name: "影视灯光艺术",
                            id: 1253
                        },
                        {
                            name: "影视动画",
                            id: 1245
                        },
                        {
                            name: "影视多媒体技术",
                            id: 1243
                        },
                        {
                            name: "影视广告",
                            id: 1252
                        },
                        {
                            name: "主持与播音",
                            id: 1244
                        },
                        {
                            name: "作曲技术",
                            id: 1264
                        },

                    ]
                },
                {
                    name: "艺术设计类",
                    content: [
                        {
                            name: "产品造型设计",
                            id: 1212
                        },
                        {
                            name: "电脑艺术设计",
                            id: 1205
                        },
                        {
                            name: "雕刻艺术与家具设计",
                            id: 1210
                        },
                        {
                            name: "雕塑艺术设计",
                            id: 1209
                        },
                        {
                            name: "多媒体设计与制作",
                            id: 1215
                        },
                        {
                            name: "广告设计与制作",
                            id: 1220
                        },
                        {
                            name: "广告与会展",
                            id: 1224
                        },
                        {
                            name: "旅游工艺品设计与制作",
                            id: 1214
                        },
                        {
                            name: "美术",
                            id: 1218
                        },
                        {
                            name: "木材加工技术",
                            id: 531
                        },
                        {
                            name: "皮具设计",
                            id: 1223
                        },
                        {
                            name: "人物形象设计",
                            id: 1208
                        },
                        {
                            name: "商务形象传播",
                            id: 1219
                        },
                        {
                            name: "视觉传达艺术设计",
                            id: 1204
                        },
                        {
                            name: "首饰设计",
                            id: 1225
                        },
                        {
                            name: "书画鉴定",
                            id: 1221
                        },
                        {
                            name: "陶瓷艺术设计",
                            id: 1322
                        },
                        {
                            name: "舞台艺术设计",
                            id: 1226
                        },
                        {
                            name: "艺术设计",
                            id: 1202
                        },
                        {
                            name: "应用艺术设计",
                            id: 1216
                        },
                        {
                            name: "钟表设计",
                            id: 1222
                        },
                        {
                            name: "珠宝首饰工艺及鉴定",
                            id: 1213
                        },
                        {
                            name: "装潢艺术设计",
                            id: 1207
                        },
                        {
                            name: "装饰艺术设计",
                            id: 1206
                        },

                    ]
                },

            ]
        },
        {
            type: 0,
            width: 2,
            name: "艺术学",
            content: [
                {
                    name: "美术学类",
                    content: [
                        {
                            name: "雕塑",
                            id: 494
                        },
                        {
                            name: "绘画",
                            id: 490
                        },
                        {
                            name: "美术学",
                            id: 492
                        },
                        {
                            name: "摄影",
                            id: 497
                        },
                        {
                            name: "书法学",
                            id: 498
                        },
                        {
                            name: "中国画",
                            id: 493
                        },

                    ]
                },
                {
                    name: "设计学类",
                    content: [
                        {
                            name: "产品设计",
                            id: 495
                        },
                        {
                            name: "服装与服饰设计",
                            id: 500
                        },
                        {
                            name: "工艺美术",
                            id: 508
                        },
                        {
                            name: "公共艺术",
                            id: 501
                        },
                        {
                            name: "环境设计",
                            id: 496
                        },
                        {
                            name: "视觉传达设计",
                            id: 499
                        },
                        {
                            name: "数字媒体艺术",
                            id: 502
                        },
                        {
                            name: "艺术设计学",
                            id: 504
                        },
                        {
                            name: "艺术与科技",
                            id: 503
                        },

                    ]
                },
                {
                    name: "戏剧与影视学类",
                    content: [
                        {
                            name: "表演",
                            id: 482
                        },
                        {
                            name: "播音与主持艺术",
                            id: 489
                        },
                        {
                            name: "电影学",
                            id: 484
                        },
                        {
                            name: "动画",
                            id: 486
                        },
                        {
                            name: "广播电视编导",
                            id: 491
                        },
                        {
                            name: "录音艺术",
                            id: 487
                        },
                        {
                            name: "戏剧学",
                            id: 476
                        },
                        {
                            name: "戏剧影视导演",
                            id: 481
                        },
                        {
                            name: "戏剧影视美术设计",
                            id: 485
                        },
                        {
                            name: "戏剧影视文学",
                            id: 480
                        },
                        {
                            name: "影视摄影与制作",
                            id: 488
                        },

                    ]
                },
                {
                    name: "艺术学理论类",
                    content: [
                        {
                            name: "艺术史论",
                            id: 477
                        },

                    ]
                },
                {
                    name: "音乐与舞蹈学类",
                    content: [
                        {
                            name: "舞蹈编导",
                            id: 478
                        },
                        {
                            name: "舞蹈表演",
                            id: 473
                        },
                        {
                            name: "舞蹈学",
                            id: 483
                        },
                        {
                            name: "音乐表演",
                            id: 470
                        },
                        {
                            name: "音乐学",
                            id: 474
                        },
                        {
                            name: "作曲与作曲技术理论",
                            id: 475
                        },

                    ]
                },

            ]
        },
        {
            type: 0,
            width: 1,
            name: "哲学",
            content: [
                {
                    name: "哲学类",
                    content: [
                        {
                            name: "伦理学",
                            id: 1317
                        },
                        {
                            name: "逻辑学",
                            id: 1
                        },
                        {
                            name: "哲学",
                            id: 3
                        },
                        {
                            name: "宗教学",
                            id: 2
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 2,
            name: "制造类",
            content: [
                {
                    name: "机电设备类",
                    content: [
                        {
                            name: "导弹维修",
                            id: 871
                        },
                        {
                            name: "电气设备应用与维护",
                            id: 865
                        },
                        {
                            name: "机电设备维修与管理",
                            id: 859
                        },
                        {
                            name: "设备安装技术",
                            id: 881
                        },
                        {
                            name: "数控设备应用与维护",
                            id: 857
                        },
                        {
                            name: "物流工程技术",
                            id: 868
                        },
                        {
                            name: "冶金设备应用与维护",
                            id: 862
                        },
                        {
                            name: "医疗电子工程",
                            id: 864
                        },
                        {
                            name: "医学影像设备管理与维护",
                            id: 863
                        },
                        {
                            name: "医用电子仪器与维护",
                            id: 858
                        },
                        {
                            name: "医用治疗设备应用技术",
                            id: 878
                        },
                        {
                            name: "自动化生产设备应用",
                            id: 861
                        },

                    ]
                },
                {
                    name: "机械设计制造类",
                    content: [
                        {
                            name: "材料成型与控制技术",
                            id: 822
                        },
                        {
                            name: "电机与电器",
                            id: 826
                        },
                        {
                            name: "电线电缆制造技术",
                            id: 839
                        },
                        {
                            name: "飞行器制造工艺",
                            id: 830
                        },
                        {
                            name: "服装机械及其自动化",
                            id: 834
                        },
                        {
                            name: "钢结构建造技术",
                            id: 833
                        },
                        {
                            name: "工业设计",
                            id: 197
                        },
                        {
                            name: "焊接技术及自动化",
                            id: 828
                        },
                        {
                            name: "焊接质量检测技术",
                            id: 827
                        },
                        {
                            name: "机械设计与制造",
                            id: 814
                        },
                        {
                            name: "机械制造工艺及设备",
                            id: 841
                        },
                        {
                            name: "机械制造生产管理",
                            id: 837
                        },
                        {
                            name: "机械制造与自动化",
                            id: 816
                        },
                        {
                            name: "机械质量管理与检测技术",
                            id: 835
                        },
                        {
                            name: "激光加工技术",
                            id: 829
                        },
                        {
                            name: "计算机辅助设计与制造",
                            id: 845
                        },
                        {
                            name: "家具设计与制造",
                            id: 842
                        },
                        {
                            name: "假肢与矫形器设计与制造",
                            id: 832
                        },
                        {
                            name: "精密机械技术",
                            id: 825
                        },
                        {
                            name: "乐器修造技术",
                            id: 847
                        },
                        {
                            name: "乐器制造技术",
                            id: 844
                        },
                        {
                            name: "模具设计与制造",
                            id: 824
                        },
                        {
                            name: "内燃机制造与维修",
                            id: 840
                        },
                        {
                            name: "数控技术",
                            id: 823
                        },
                        {
                            name: "锁具设计与工艺",
                            id: 843
                        },
                        {
                            name: "特种加工技术",
                            id: 846
                        },
                        {
                            name: "玩具设计与制造",
                            id: 820
                        },
                        {
                            name: "武器制造技术",
                            id: 838
                        },
                        {
                            name: "药剂设备制造与维护",
                            id: 836
                        },
                        {
                            name: "医疗器械制造与维护",
                            id: 831
                        },

                    ]
                },
                {
                    name: "汽车类",
                    content: [
                        {
                            name: "摩托车制造与维修",
                            id: 887
                        },
                        {
                            name: "农业机械应用技术",
                            id: 876
                        },
                        {
                            name: "汽车电子技术",
                            id: 869
                        },
                        {
                            name: "汽车改装技术",
                            id: 872
                        },
                        {
                            name: "汽车技术服务与营销",
                            id: 875
                        },
                        {
                            name: "汽车检测与维修技术",
                            id: 867
                        },
                        {
                            name: "汽车营销与维修",
                            id: 874
                        },
                        {
                            name: "汽车运用与维修",
                            id: 873
                        },
                        {
                            name: "汽车整形技术",
                            id: 870
                        },
                        {
                            name: "汽车制造与装配技术",
                            id: 866
                        },

                    ]
                },
                {
                    name: "自动化类",
                    content: [
                        {
                            name: "包装自动化技术",
                            id: 854
                        },
                        {
                            name: "电力系统自动化技术",
                            id: 848
                        },
                        {
                            name: "电气自动化技术",
                            id: 849
                        },
                        {
                            name: "工业网络技术",
                            id: 850
                        },
                        {
                            name: "机电一体化技术",
                            id: 852
                        },
                        {
                            name: "计算机控制技术",
                            id: 855
                        },
                        {
                            name: "检测技术及应用",
                            id: 856
                        },
                        {
                            name: "理化测试及质检技术",
                            id: 860
                        },
                        {
                            name: "生产过程自动化技术",
                            id: 853
                        },
                        {
                            name: "液压与气动技术",
                            id: 851
                        },

                    ]
                },

            ]
        },
        {
            type: 1,
            width: 4,
            name: "资源开发与测绘类",
            content: [
                {
                    name: "测绘类",
                    content: [
                        {
                            name: "测绘工程技术",
                            id: 731
                        },
                        {
                            name: "测绘与地理信息技术",
                            id: 723
                        },
                        {
                            name: "测绘与地质工程技术",
                            id: 729
                        },
                        {
                            name: "大地测量与卫星定位技术",
                            id: 718
                        },
                        {
                            name: "地籍测绘与土地管理信息技术",
                            id: 724
                        },
                        {
                            name: "地理信息系统与地图制图技术",
                            id: 721
                        },
                        {
                            name: "工程测量技术",
                            id: 717
                        },
                        {
                            name: "工程测量与监理",
                            id: 719
                        },
                        {
                            name: "矿山测量",
                            id: 722
                        },
                        {
                            name: "摄影测量与遥感技术",
                            id: 716
                        },

                    ]
                },
                {
                    name: "地质工程与技术类",
                    content: [
                        {
                            name: "地球化学勘查技术",
                            id: 685
                        },
                        {
                            name: "地球物理测井技术",
                            id: 684
                        },
                        {
                            name: "地球物理勘查技术",
                            id: 688
                        },
                        {
                            name: "地质信息技术",
                            id: 690
                        },
                        {
                            name: "地质灾害与防治技术",
                            id: 683
                        },
                        {
                            name: "工程地震与工程勘察",
                            id: 694
                        },
                        {
                            name: "工程地质勘查",
                            id: 679
                        },
                        {
                            name: "环境地质工程技术",
                            id: 699
                        },
                        {
                            name: "矿山地质",
                            id: 686
                        },
                        {
                            name: "水文与工程地质",
                            id: 681
                        },
                        {
                            name: "岩土工程技术",
                            id: 687
                        },
                        {
                            name: "钻探技术",
                            id: 680
                        },

                    ]
                },
                {
                    name: "矿物加工类",
                    content: [
                        {
                            name: "矿物加工技术",
                            id: 740
                        },
                        {
                            name: "煤炭深加工与利用",
                            id: 715
                        },
                        {
                            name: "煤质分析技术",
                            id: 720
                        },
                        {
                            name: "选矿机电技术",
                            id: 713
                        },
                        {
                            name: "选矿技术",
                            id: 714
                        },
                        {
                            name: "选煤技术",
                            id: 712
                        },

                    ]
                },
                {
                    name: "矿业工程类",
                    content: [
                        {
                            name: "非金属矿开采技术",
                            id: 692
                        },
                        {
                            name: "固体矿床露天开采技术",
                            id: 697
                        },
                        {
                            name: "金属矿开采技术",
                            id: 691
                        },
                        {
                            name: "矿井建设",
                            id: 702
                        },
                        {
                            name: "矿井通风与安全",
                            id: 695
                        },
                        {
                            name: "矿井运输与提升",
                            id: 696
                        },
                        {
                            name: "矿山安全技术与监察",
                            id: 706
                        },
                        {
                            name: "矿山机电",
                            id: 700
                        },

                    ]
                },

            ]
        }
];